agenticaiuw/hivemind/firmware/nrf9160/src/main.c
#include <errno.h>
#include <stdint.h>
#include <string.h>
#include <zephyr/device.h>
#include <zephyr/drivers/adc.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/i2s.h>
#include <zephyr/fs/fs.h>
#include <zephyr/kernel.h>
#include <zephyr/sys/printk.h>
#include <zephyr/sys/util.h>
#include <zephyr/drivers/clock_control/nrf_clock_control.h>
#include <zephyr/sys/onoff.h>
#include <hal/nrf_gpio.h>
#include <hal/nrf_pwm.h>
#include <hal/nrf_saadc.h>
#include <hal/nrf_egu.h>
#include <hal/nrf_dppi.h>
#include <helpers/nrfx_gppi.h>
#include <ff.h>

#include "audio_opus.h"
#include "bench.h"
#include "haptic.h"
#include "pendant_bt.h"
#include "pendant_cloud.h"
#include "pendant_reflex.h"
#include "pendant_status.h"
#include "pendant_store.h"
#include "pendant_ws.h"
#include "tx_resample_taps.h"

#define LED_NODE DT_ALIAS(led0)
#define BUTTON_NODE DT_ALIAS(sw0)
/*
 * Button 2 = drop a moment bookmark.
 *
 * The alternative was a gesture on button 1 (double-press, or press-and-
 * hold), and both cost the thing this firmware protects hardest: button 1
 * acts on the ACTIVE EDGE so the microphone is powering up before the
 * owner's finger has come back off. Any gesture means waiting several
 * hundred ms to find out which gesture it was, on every single press, to
 * serve the rarer of the two actions. A second physical button costs
 * nothing on the hot path.
 */
#define MARK_BUTTON_NODE DT_ALIAS(sw1)
#define I2S_NODE DT_NODELABEL(i2s0)
/*
 * ---- Breadboard hardware controls (parts arrived 2026-08-12) ----
 *
 * Every one of these is optional at boot, exactly like the bookmark
 * button: a control that fails to configure logs once and disappears,
 * because a loose jumper must never brick a voice pendant. Pin claims
 * and pull policy live in the overlay's pendant_controls node; the
 * split of duties here is:
 *
 * WHAT EACH BUTTON MEANS DEPENDS ON WHETHER A RING IS OPEN. The relay owns
 * the ring and tells the device with {"type":"menu_context","active":bool};
 * with no such frame the device uses the GLOBAL column, always. See
 * menu_context_active and docs/Screenless_App_Grammar.md.
 *
 *                      ring CLOSED (global)          ring OPEN
 *   P0.21 yellow       short: start/stop the         menu_select
 *                      conversation                  (commit the entry)
 *                      long (600 ms): push-to-talk
 *   P0.22 green        nothing — wires are off       nothing
 *   P0.23 blue         memo (record-only, no         menu_back
 *                      planner, ?dispatch=0)         (one level up)
 *
 *   P0.21 yellow  — also a second body for the DK's button 1: it gives the
 *                   SAME semaphore, so every path that already understands
 *                   button 1 hears it with zero new states.
 *   P0.22 green   — DEAD. The owner's wires came off and cannot be refitted,
 *                   so it is assigned nothing that matters. Presses are
 *                   drained so none can be banked and replayed.
 *   P0.23 blue    — memo when no ring is open. Push-to-talk moved OFF this
 *                   button to a long yellow hold on 2026-08-13; the energy
 *                   ruling that gave PTT its own gesture is unchanged (2.4x
 *                   cheaper than a duplex exchange), only which gesture.
 *   P0.24/25      — quadrature menu navigation, one detent = exactly one
 *                   unit, no acceleration. Turning is ALL it does: the
 *                   owner's knob has no switch wired (three wires: A,
 *                   C=GND, B) and the buttons do the selecting, so P0.28 is
 *                   unwired and unclaimed and dwell-to-select is gone.
 *   P0.26         mic sense  — watches the SPH0645 VDD net through 100k.
 *                              Low = the owner cut mic power with the
 *                              latching switch: capture must not start,
 *                              and must SAY so rather than record hiss.
 *
 * ---- Sensor/audio additions (same parts order) ----
 *
 *   P0.15 (AIN2)  volume pot — wiper of the knob, polled on the SAADC
 *                              (the ESP32's GPIO34 job, moved here: the
 *                              ESP32 stands in for a dumb BT module, so
 *                              the knob must not live on it).
 *   P0.01         amp SD     — MAX98357A SD_MODE gate. High = wired
 *                              speaker plays the left I2S slot, low =
 *                              amp shutdown. Owner-selected via
 *                              {"type":"audio_sink"} control frames.
 */
#define ASK_BUTTON_NODE DT_ALIAS(ask_btn)
#define MEMO_BUTTON_NODE DT_ALIAS(memo_btn)
#define PTT_BUTTON_NODE DT_ALIAS(ptt_btn)
#define ENCODER_A_NODE DT_ALIAS(encoder_a)
#define ENCODER_B_NODE DT_ALIAS(encoder_b)
#define MIC_SENSE_NODE DT_ALIAS(mic_sense)
#define AMP_SD_MODE_NODE DT_ALIAS(amp_sd_mode)

/*
 * Adafruit SPH0645LM4H I2S microphone capture.
 *
 * The SPH0645 requires BCLK between 1.024 and 4.096 MHz with LRCLK at
 * exactly BCLK/64.  The nRF9160 I2S peripheral cannot produce a 64-BCLK
 * frame as master (its 24-bit maximum word size yields 48 BCLK), so the
 * capture path instead runs I2S in slave mode and generates both clocks
 * with PWM peripherals driven from the shared 16 MHz PCLK16M:
 *
 *   BCLK  = 16 MHz / 8   = 2.000 MHz on P0.16 (A2), jumpered to P0.18
 *   LRCLK = 16 MHz / 512 = 31.25 kHz on P0.14 (A0), jumpered to P0.17
 *
 * Both PWMs start in the same clock cycle through one DPPI channel, so
 * LRCLK edges always land on BCLK falling edges as I2S requires.  The
 * mic (SEL grounded) drives the left slot; each RX word arrives as one
 * right-aligned, sign-extended 24-bit sample with 18 significant bits.
 * Adjacent frames are averaged down to a 15,625 Hz mono upload stream.
 */
#define MIC_BCLK_PIN 16U
#define MIC_LRCLK_PIN 14U
#define MIC_DATA_PIN 20U
/* Bus-side I2S clock pins, jumpered to the PWM outputs above. */
#define MIC_I2S_LRCK_PIN 17U
#define MIC_I2S_SCK_PIN 18U
#define MIC_BCLK_TOP 8U
#define MIC_LRCLK_TOP 512U
#define MIC_FRAME_RATE 31250U
#define MIC_DECIMATION 2U
#define SAMPLE_RATE (MIC_FRAME_RATE / MIC_DECIMATION)

#define MIC_RX_BLOCK_FRAMES 640U
#define MIC_RX_BLOCK_SIZE (MIC_RX_BLOCK_FRAMES * sizeof(int32_t))
/*
 * RX slab is dedicated so the Opus workspace can hold the live encoder
 * while the user is speaking. An i2s_nrfx RX overrun ERRORS the whole
 * transfer (it does not drop-and-continue), so this must ride out codec
 * spikes on the duplex path.
 *
 * Size it ABOVE the driver's queue depth, not equal to it: the driver
 * holds CONFIG_I2S_NRFX_RX_BLOCK_COUNT (6) blocks in its queue PLUS 2
 * latched in hardware, and this loop holds 1 while copying. A 6-block
 * slab therefore died at a 4-block backlog ("Failed to allocate next RX
 * buffer: -12") on a 76 ms loop spike. 10 blocks = a full 6-block (123 ms)
 * backlog with buffers to spare.
 */
#define MIC_RX_BLOCK_COUNT 10U
#define MIC_OUT_BLOCK_FRAMES (MIC_RX_BLOCK_FRAMES / MIC_DECIMATION)
#define MIC_STAGE_FRAMES 512U
#define MIC_STAGE_BYTES (MIC_STAGE_FRAMES * sizeof(int16_t))
/*
 * Live TX is streaming Opus (SILK-WB, ~16 kbps, 20 ms frames): measured
 * real-world LTE-M here sustains only 24-55 kbps each way, which starves
 * even 64 kbps μ-law. Workspace layout during capture: encoder arena at the
 * front, wire-framed packet FIFO ([u16 BE length][packet]) in the rest —
 * ~13 KiB of FIFO holds ≈6 s of encoded speech.
 */
#define OPUS_TX_ARENA_BYTES (17U * 1024U)
#define OPUS_TX_FIFO_BYTES \
	(PENDANT_AUDIO_WORKSPACE_BYTES - OPUS_TX_ARENA_BYTES)
/* Batch ≥3 packets per HTTP chunk so TLS/TCP overhead amortizes (~60 ms). */
#define LIVE_TX_BATCH_BYTES 120U
#define LIVE_TX_WRITE_MAX 512U
/* Max LTE work per capture block so I2S DMA never starves. */
/* Slightly more LTE work per I2S block to keep the ring drained. */
#define PCM_TX_PUMP_BUDGET_MS 5U
#define PCM_TX_DRAIN_BUDGET_MS 12U
#define MAX_RECORD_SECONDS 30U
#define MAX_RECORD_SAMPLE_COUNT (SAMPLE_RATE * MAX_RECORD_SECONDS)
#define AUTORECORD_TEST_SECONDS 5U
#define AUTORECORD_TEST_SAMPLE_COUNT \
	(SAMPLE_RATE * AUTORECORD_TEST_SECONDS)
/* SPH0645 t_powerup is ≤50 ms once BCLK runs; only remainder is slept. */
#define MIC_POWERUP_BUDGET_MS 50
/* Discard the first RX block: slave sync and DMA-start artifacts. */
#define MIC_STARTUP_SKIP_BLOCKS 1U
/* Keep clocks alive briefly after DROP so I2S can reach STOPPED. */
#define MIC_STOP_SETTLE_MS 12
#define MIC_MIN_RECORD_FRAMES SAMPLE_RATE
/*
 * End-of-utterance detection: speak, pause ~1.5 s, and the turn ends — no
 * second button press. Thresholds ride the recording's own measured noise
 * floor (quietest stage so far), not fixed levels, so mic gain and room
 * noise calibrate themselves per press.
 */
#define SILENCE_STOP_MS 1500U
#define SILENCE_STOP_STAGES \
	((SILENCE_STOP_MS * SAMPLE_RATE) / (MIC_STAGE_FRAMES * 1000U) + 1U)
/* ~260 ms of clearly-voiced audio before silence can end the turn. */
#define VOICED_STAGES_REQUIRED 8U
/* Accidental press with no speech at all: stop after 6 s, not 30. */
#define NO_SPEECH_STOP_SECONDS 6U
/* One-pole DC blocker, y[n] = x[n] - x[n-1] + a*y[n-1], a = 0.995. */
#define MIC_HPF_COEFF_Q15 32604
/* Digital gain standing in for the PDM peripheral's former +12 dB. */
#define MIC_GAIN 4
/*
 * The SPH0645 launches data on the rising BCLK edge instead of the
 * standard falling edge.  If captures come back doubled or wrapped, the
 * receiver latched one bit early: set this to 1 to halve each raw word.
 */
#define MIC_SAMPLE_SHIFT 0
/*
 * Impulse rejector: microSD SPI bursts can couple into the mic lines on
 * the breadboard and flip a high bit in isolated samples, which lands as
 * a full-scale click at the flush cadence.  Real audio from this mic
 * cannot slew more than a small fraction of full scale in one 32 us
 * sample, so clamp per-sample deltas in the raw 24-bit domain.  1/8 of
 * full scale per sample passes every legitimate signal untouched.
 */
#define MIC_SLEW_LIMIT (1 << 20)
#define MIC_RAW_PROBE_BITS 2048U
/* The DPPIC is node 0 of the generic PPI helper on this device. */
#define MIC_GPPI_NODE 0U

#define I2S_BLOCK_FRAMES 256U
#define I2S_CHANNEL_COUNT 2U
#define I2S_BLOCK_SIZE \
	(I2S_BLOCK_FRAMES * I2S_CHANNEL_COUNT * sizeof(int16_t))
/* Cut from 16 to free RAM for live Opus + dedicated mic RX. */
#define I2S_BLOCK_COUNT 4U
#define I2S_PREFILL_BLOCKS 3U
#define I2S_SYNC_PATTERN_BLOCKS 2U
#define I2S_SYNC_END_FRAMES 16U
#define I2S_STREAM_SYNC_A 0x2468
#define I2S_STREAM_SYNC_B 0x5A5A
#define I2S_STREAM_SYNC_END 0x6C6C

