agenticaiuw/hivemind/firmware/nrf9160/src/main.c
/*
 * Owner-decision control frames, produced on main/ISR/workqueue and consumed
 * by the WS I/O thread — the one place allowed to touch the socket, so a
 * stalled modem send can never block a button ISR or the codec loop. Contract
 * per the wire spec: sent only while the converse socket is OPEN; a closed
 * socket drops them (a menu twist from a dead zone is stale the moment
 * the link returns).
 */
static atomic_t menu_step_backlog;     /* signed detents not yet sent */
static atomic_t menu_select_req;       /* yellow, pressed while the ring is open */
static atomic_t menu_back_req;         /* blue, pressed while the ring is open */
/*
 * WHICH VERBS THE TWO BUTTONS CURRENTLY CARRY — and it is not the device's
 * opinion.
 *
 * The ring lives on the relay (docs/Screenless_App_Grammar.md), so the device
 * genuinely cannot work out which context it is in; the relay tells it with
 * {"type":"menu_context","active":bool} on every ring open, every ring close
 * and every conversation teardown, sent AHEAD of the earcon that announces the
 * same transition and never awaited.
 *
 *   active = 0  yellow = talk (short) / push-to-talk (long),  blue = memo
 *   active = 1  yellow = select,                              blue = back
 *
 * THE FAILURE MODE IS ASYMMETRIC AND THIS DEFAULT IS THE WHOLE POINT. Zero at
 * boot, zero whenever the socket is not up, zero the moment a conversation
 * ends. If the frame is lost, late, or never arrives, the buttons fall back to
 * the GLOBAL verbs — a dropped frame then costs the owner a stray memo, which
 * is recoverable and audible the instant it happens. Defaulting the other way
 * would cost them a push-to-talk that silently did nothing, on the one device
 * that cannot show them why.
 */
static atomic_t menu_context_active;

static inline bool menu_context_is_active(void)
{
	return atomic_get(&menu_context_active) != 0;
}

/*
 * Fail-safe, called from every path that ends or loses a conversation.
 * A ring cannot outlive the socket that owns it, so the device drops back to
 * the global verbs itself rather than waiting to be told — the relay's
 * teardown frame is best-effort by design and a socket that died has no way
 * to send it at all.
 */
static void menu_context_clear(const char *why)
{
	if (atomic_set(&menu_context_active, 0) != 0) {
		printk("Menu context -> global (%s): yellow=talk, blue=memo\n",
		       why);
	}
	atomic_set(&menu_select_req, 0);
	atomic_set(&menu_back_req, 0);
}

/*
 * {"type":"menu_context","active":true|false}
 *
 * Offered FIRST of all the downlink frames, ahead of even the recipe matcher.
 * Every other frame can afford to be handled a tick later; this one decides
 * what the owner's very next press means, and the relay deliberately sends it
 * ahead of the sound that announces the transition precisely so a press landing
 * during the earcon still fires the right verb.
 *
 * The value is read by scanning past "active" rather than matching
 * "\"active\":true" literally: a stray space after the colon would otherwise
 * read as false, and silently reverting to global verbs is the one failure this
 * whole mechanism exists to make loud. A frame with no "active" key at all is
 * still treated as false — that is the safe direction.
 */
static bool menu_context_offer_frame(const char *frame)
{
	const char *cursor = strstr(frame, "\"menu_context\"");
	bool active = false;

	if (cursor == NULL) {
		return false;
	}
	cursor = strstr(frame, "\"active\"");
	if (cursor != NULL) {
		cursor += sizeof("\"active\"") - 1U;
		while (*cursor == ':' || *cursor == ' ') {
			++cursor;
		}
		active = *cursor == 't';
	}
	if (atomic_set(&menu_context_active, active ? 1 : 0) !=
	    (active ? 1 : 0)) {
		printk("Menu context -> %s\n",
		       active ? "ring (yellow=select, blue=back)"
			      : "global (yellow=talk, blue=memo)");
	}
	if (!active) {
		/* Nothing half-sent may survive the ring it belonged to. */
		atomic_set(&menu_select_req, 0);
		atomic_set(&menu_back_req, 0);
	}
	return true;
}
/*
 * The microSD did not come up, so the outbox, the alert inbox and the
 * offline capture journal are gone for this boot. Everything else works.
 *
 * NOT drop-when-closed, unlike every other frame in this group, and the
 * difference is the whole point. A menu twist banked across a dead link is
 * stale intent; "your storage is gone" is still true an hour later, and the
 * owner has no other way to learn it — this device can only speak inside a
 * started conversation, so the first socket that opens is the first chance
 * it has to say a sentence at all. Sent once per boot, then latched off.
 */
static bool storage_degraded;
static atomic_t storage_notice_req;
/* Cap unsent detents: past this the owner is spinning against a dead
 * link and older steps carry no information a fresher one lacks. */
#define MENU_STEP_BACKLOG_MAX 8
/*
 * THE ENCODER TURNS AND NOTHING ELSE — and dwell-to-select is GONE.
 *
 * The knob is the illuminated type and only its three rotation pins are wired
 * (A -> P0.24, C -> GND, B -> P0.25); P0.28 is unwired and has no handler.
 * That left no press on the knob, and for a day the answer was DWELL: resting
 * for 1500 ms after the last detent counted as the select.
 *
 * The owner overruled it, 2026-08-13, verbatim: "remember we can use the
 * fucking buttons bro, right now it seems like you're using stopping the
 * turning as confirmation for selecting but we should just use a button. only
 * when no [app] is selected those buttons are reserved for the llm talk and
 * the memo."
 *
 * So selection is a YELLOW PRESS and escape is a BLUE PRESS, and which verb
 * each button carries depends on menu_context_active above. Dwell had to be
 * deleted rather than merely unused: the relay stopped expecting it (a rested
 * knob is no longer a commit anywhere in menuRing.js), so a timer still firing
 * here would commit ring entries the owner never chose — the worst possible
 * residue on a device with no screen to show what just got selected.
 *
 * One detent is exactly one unit, at any speed. No acceleration: an earlier
 * version had it and the owner rejected it.
 *
 * The ~200 ms settle survives, but it lives on the RELAY and was never a
 * selection mechanism — it only decides when the ring is allowed to speak.
 */

