agenticaiuw/hivemind/firmware/nrf9160/src/main.c
/*
 * Debug press hook: a debugger (J-Link) can write 1 here to simulate a
 * button press without touching the hardware —
 *   JLinkExe -device nRF9160_xxAA -if SWD -speed 4000 -autoconnect 1
 *   w4 <&pendant_remote_press> 1
 * Polled wherever the firmware waits on the button.
 */
volatile uint32_t pendant_remote_press;

/*
 * Bench probe mode: while non-zero, a button press is observed and reported
 * but performs no action. See the idle loop for the full reasoning and the
 * J-Link incantation; it lives here beside pendant_remote_press because it is
 * the same kind of hook — a plain volatile a debugger writes, no protocol on
 * the target — and because the two are each other's opposite: one fakes a
 * press that never happened, the other swallows a press that did.
 */
volatile uint32_t pendant_bench_probe;

/*
 * RELAY FRAME INJECTION — test the parser, not a flag that resembles it.
 *
 * Verifying menu_context by writing menu_context_active over SWD proves the
 * button mapping and nothing about the thing most likely to be wrong: whether
 * the device recognises the relay's actual bytes. A frame that arrives and is
 * silently unmatched is indistinguishable, from the outside, from a frame that
 * arrived and worked — and it fails toward the global verbs, which is the safe
 * direction and therefore the SILENT one.
 *
 * So: write the JSON here, set _ready, and the idle loop hands it to the exact
 * same dispatch chain a socket frame goes through. Not a second code path — the
 * same one.
 *
 *   w4 <&pendant_remote_frame>[..] = the bytes
 *   w4 <&pendant_remote_frame_ready> 1
 *
 * Diagnostic only, and it cannot fabricate anything a real relay could not
 * send: every frame still has to survive the same matchers.
 */
volatile char pendant_remote_frame[96];
volatile uint32_t pendant_remote_frame_ready;

static bool take_remote_press(void)
{
	if (pendant_remote_press == 0U) {
		return false;
	}
	pendant_remote_press = 0U;
	return true;
}

/* ---- Hardware-control ISRs and pollers ---- */

static void green_button_pressed(const struct device *port,
				struct gpio_callback *callback,
				gpio_port_pins_t pins)
{
	ARG_UNUSED(port);
	ARG_UNUSED(callback);
	ARG_UNUSED(pins);
	pendant_bench_note_button(PENDANT_BENCH_GREEN);
	k_sem_give(&green_press_sem);
}

static void blue_button_pressed(const struct device *port,
			       struct gpio_callback *callback,
			       gpio_port_pins_t pins)
{
	ARG_UNUSED(port);
	ARG_UNUSED(callback);
	ARG_UNUSED(pins);
	pendant_bench_note_button(PENDANT_BENCH_BLUE);
	k_sem_give(&blue_press_sem);
}

static bool take_green_press(void)
{
	return k_sem_take(&green_press_sem, K_NO_WAIT) == 0;
}

static void clear_green_events(void)
{
	while (k_sem_take(&green_press_sem, K_NO_WAIT) == 0) {
	}
}

static bool take_blue_press(void)
{
	return k_sem_take(&blue_press_sem, K_NO_WAIT) == 0;
}

static void clear_blue_events(void)
{
	while (k_sem_take(&blue_press_sem, K_NO_WAIT) == 0) {
	}
}

/*
 * Quadrature decode, both edges of both phases, via the standard Gray-code
 * transition table — NOT edge counting. Contact bounce only ever toggles
 * between two ADJACENT states, so a bouncing contact contributes +1 -1 +1
 * -1 ... which sums to nothing; an invalid two-bit jump (electrical noise)
 * scores 0 outright. A mechanical detent is four valid transitions, so the
 * accumulator emits one menu step per ±4 and the half-states a finger
 * resting between detents produces are never heard upstream.
 */
static const int8_t encoder_quad_table[16] = {
	0, -1, 1, 0, 1, 0, 0, -1, -1, 0, 0, 1, 0, 1, -1, 0,
};
static uint8_t encoder_prev_state;
static int8_t encoder_detent_accum;

static uint8_t encoder_read_state(void)
{
	/* Raw levels, not logical: quadrature only cares about transitions,
	 * and the raw read avoids two layered driver calls in an ISR. */
	return (uint8_t)((nrf_gpio_pin_read(encoder_a.pin) << 1) |
			 nrf_gpio_pin_read(encoder_b.pin));
}

static void encoder_edge_isr(const struct device *port,
			     struct gpio_callback *callback,
			     gpio_port_pins_t pins)
{
	ARG_UNUSED(port);
	ARG_UNUSED(callback);
	ARG_UNUSED(pins);

	uint8_t state = encoder_read_state();
	int8_t increment =
		encoder_quad_table[(encoder_prev_state << 2) | state];

	encoder_prev_state = state;
	if (increment == 0) {
		return;
	}
	encoder_detent_accum += increment;
	if (encoder_detent_accum >= 4 || encoder_detent_accum <= -4) {
		int step = encoder_detent_accum > 0 ? 1 : -1;
		atomic_val_t backlog = atomic_get(&menu_step_backlog);

		encoder_detent_accum = 0;
		/*
		 * Counted here rather than off the backlog: the backlog is
		 * capped and cleared when the link is down, so counting it
		 * would make the bench report "the knob stopped working" for
		 * what is really "the socket is closed". The detent happened
		 * either way, and that is the wire question.
		 */
		pendant_bench_note_detent(step);
		/* Single ISR producer, so this check-then-add cannot race
		 * itself; the WS thread only ever moves the value toward
		 * zero, which makes the cap conservative, never wrong. */
		if (backlog < MENU_STEP_BACKLOG_MAX &&
		    backlog > -MENU_STEP_BACKLOG_MAX) {
			atomic_add(&menu_step_backlog, step);
		}
		/*
		 * And that is the entire ISR now. It used to also restart a
		 * dwell timer, because resting the knob was the select; the
		 * owner replaced that with a yellow press, so a detent means
		 * exactly one thing again — scroll by one.
		 */
	}
}

/*
 * The mic-power sense reads the SPH0645 VDD net through 100k. Logical 0 =
 * the latching switch has the mic dark. A sense pin that never configured
 * reports "not muted": the failure mode of a missing wire must be a
 * working microphone, not a pendant that silently refuses to listen.
 */
static bool mic_power_is_cut(void)
{
	return mic_sense_ready && gpio_pin_get_dt(&mic_sense) == 0;
}

/*
 * Yellow carries BOTH talk verbs now, separated by how long it is held.
 * Owner's ruling, 2026-08-13: "yellow combine both and blue is for memo."
 *
 * 600 ms. Short enough that nobody holds it by accident, long enough that a
 * decisive tap never trips it.
 *
 * THE OLD OBJECTION, AND WHY IT NO LONGER WINS. The comment on MARK_BUTTON_NODE
 * argues hard against gestures on button 1: acting on the ACTIVE EDGE means the
 * microphone is powering up before the owner's finger comes back off, and a
 * gesture costs several hundred ms on EVERY press to serve the rarer action. It
 * was right — while a second physical button was available to take the rarer
 * verb. Blue is memo now and green's wires are off, so there is no second button
 * left to give push-to-talk, and the choice is a gesture or losing the 2.4x
 * cheaper question entirely (hardware/design/Solar_Feasibility.md §4.3).
 *
 * The cost is smaller than the old objection assumed, because this polls at
 * 10 ms and returns THE INSTANT the button comes up. A normal tap resolves in
 * its own 80-150 ms, not in 600: the conversation is delayed by exactly as long
 * as the owner's own press, which is unavoidable and imperceptible. Only a real
 * long press pays the full 600 ms, and it is supposed to.
 *
 * The strong haptic fires AT the threshold, not after the capture starts, so the
 * thumb learns which verb it just bought while it is still holding the button —
 * the only feedback a screenless device can give about a gesture in progress.
 */
#define YELLOW_LONG_PRESS_MS 600

