agenticaiuw/hivemind/firmware/nrf9160/src/main.c
static bool yellow_held_long(void)
{
	int64_t deadline;

	/*
	 * The DK's own button 1 shares this semaphore, and a press that came
	 * from there leaves P0.21 resting high — so it reads as short and
	 * takes the conversation path, which is what it has always done.
	 * Same for the SWD remote-press hook.
	 */
	if (!ask_button_ready) {
		return false;
	}
	deadline = k_uptime_get() + YELLOW_LONG_PRESS_MS;
	while (k_uptime_get() < deadline) {
		/* Logical, not raw: gpio_pin_get_dt applies GPIO_ACTIVE_LOW,
		 * so 1 means "still pressed" on this board. */
		if (gpio_pin_get_dt(&ask_button) != 1) {
			return false;
		}
		k_msleep(10);
		/* The bench keeps watching through the hold, so the owner can
		 * see the pad stay low for the whole gesture. */
		pendant_bench_tick();
	}
	haptic_trigger(HAPTIC_PATTERN_STRONG);
	return true;
}

/* ---- Volume knob: SAADC one-shot polling ---- */

#if DT_NODE_HAS_STATUS(DT_NODELABEL(adc), okay)
static const struct device *const volume_adc =
	DEVICE_DT_GET(DT_NODELABEL(adc));
#define VOLUME_ADC_CHANNEL_ID 2

static void volume_adc_init(void)
{
	/*
	 * VDD/4 reference with 1/4 gain makes the conversion ratiometric to
	 * the very rail the pot spans: full scale IS the rail, so a sagging
	 * breadboard supply cancels out of the knob position entirely.
	 * 10 us acquisition covers the wiper's worst-case source impedance
	 * (a 50 k pot at mid-travel is 12.5 k; the SAADC spec allows up to
	 * 40 k at 10 us).
	 */
	static const struct adc_channel_cfg cfg = {
		.gain = ADC_GAIN_1_4,
		.reference = ADC_REF_VDD_1_4,
		.acquisition_time =
			ADC_ACQ_TIME(ADC_ACQ_TIME_MICROSECONDS, 10),
		.channel_id = VOLUME_ADC_CHANNEL_ID,
		/* P0.15, the last free AIN */
		.input_positive = NRF_SAADC_INPUT_AIN2,
	};

	if (!device_is_ready(volume_adc) ||
	    adc_channel_setup(volume_adc, &cfg) != 0) {
		printk("Volume knob (P0.15/AIN2) not configured — unity "
		       "gain\n");
		return;
	}
	volume_adc_ready = true;
	printk("Volume knob ready (P0.15/AIN2, ratiometric, ~20 Hz poll)\n");
}

static int volume_adc_read_raw(void)
{
	int16_t sample;
	struct adc_sequence sequence = {
		.channels = BIT(VOLUME_ADC_CHANNEL_ID),
		.buffer = &sample,
		.buffer_size = sizeof(sample),
		.resolution = 12,
		/* 4x hardware oversample: the SAADC's flicker at this gain
		 * is a couple of LSB; burst-averaging in silicon is cheaper
		 * than the ESP32's median-of-five in code. */
		.oversampling = 2U,
	};

	if (adc_read(volume_adc, &sequence) != 0) {
		return -1;
	}
	/* Single-ended reads can dip a hair below zero near GND. */
	return CLAMP((int)sample, 0, VOLUME_RAW_MAX);
}
#else
static void volume_adc_init(void)
{
	printk("Volume knob: no ADC in devicetree — unity gain\n");
}

static int volume_adc_read_raw(void)
{
	return -1;
}
#endif /* adc */

/*
 * ~20 Hz knob poll, callable from any loop that turns often enough (the
 * idle wait at 200 ms and the conversation loop at ~20 ms both call it;
 * the interval gate makes extra calls free).  One blocking one-shot read
 * costs tens of microseconds — noise against the 205 ms TX runway.
 * Hysteresis (>=2 % movement) keeps a resting knob silent; the end-stop
 * snap lets true 0 and true unity be reached, which hysteresis alone
 * would forbid.  The curve is squared (perceived loudness tracks power),
 * identical to the ESP32 implementation this replaces.
 */
static void volume_poll(void)
{
	int64_t now = k_uptime_get();
	int raw;
	uint32_t gain;
	uint32_t hundredths;

	if (!volume_adc_ready || now < volume_next_poll_ms) {
		return;
	}
	volume_next_poll_ms = now + VOLUME_POLL_INTERVAL_MS;

	raw = volume_adc_read_raw();
	if (raw < 0) {
		return;
	}
	/*
	 * The bench sees the count BEFORE the end-stop snap and the 2 %
	 * hysteresis below. Those exist so a resting knob does not retrigger
	 * the volume path; a bench that inherited them would tell the owner
	 * their pot is dead through the first 80 counts of travel.
	 */
	pendant_bench_note_pot(raw);
	if (raw <= VOLUME_SNAP_LOW) {
		raw = 0;
	} else if (raw >= VOLUME_SNAP_HIGH) {
		raw = VOLUME_RAW_MAX;
	}
	if (volume_last_raw >= 0 &&
	    (raw > volume_last_raw ? raw - volume_last_raw
				   : volume_last_raw - raw) <
		    VOLUME_HYSTERESIS_COUNTS &&
	    raw != 0 && raw != VOLUME_RAW_MAX) {
		return;
	}
	if (raw == volume_last_raw) {
		return;
	}
	volume_last_raw = raw;

	/* level = (raw/4095)^2, folded straight into Q12. */
	gain = (uint32_t)(((uint64_t)raw * (uint64_t)raw *
			   VOLUME_GAIN_UNITY_Q12 +
			   ((uint64_t)VOLUME_RAW_MAX * VOLUME_RAW_MAX / 2U)) /
			  ((uint64_t)VOLUME_RAW_MAX * VOLUME_RAW_MAX));
	atomic_set(&volume_gain_q12, (atomic_val_t)gain);

	hundredths = (gain * 100U + VOLUME_GAIN_UNITY_Q12 / 2U) /
		     VOLUME_GAIN_UNITY_Q12;
	atomic_set(&volume_report,
		   (atomic_val_t)((hundredths << 16) | (uint32_t)raw));
	printk("Volume: raw=%d level=%u.%02u\n", raw, hundredths / 100U,
	       hundredths % 100U);
}

/* ---- Wired speaker sink gate ---- */

static const char *audio_sink_name(uint8_t sink)
{
	switch (sink) {
	case AUDIO_SINK_SPEAKER:
		return "speaker";
	case AUDIO_SINK_BOTH:
		return "both";
	default:
		return "bluetooth";
	}
}

/* Safe from any thread: one gpio_pin_set_dt on a pin only this touches, plus
 * a flag the idle loop acts on. */
static void audio_sink_apply(uint8_t sink)
{
	audio_sink_current = sink;
	if (amp_sd_mode_ready) {
		gpio_pin_set_dt(&amp_sd_mode, sink != AUDIO_SINK_BLUETOOTH);
	}
	/*
	 * Choosing Bluetooth as the sink is also an instruction to HAVE a
	 * Bluetooth link: a sink selection that leaves the module idle would
	 * route the next answer into silence. The request is only a flag —
	 * pendant_bt_poll on main owns the UART.
	 */
	if (sink != AUDIO_SINK_SPEAKER && !pendant_bt_link_up()) {
		pendant_bt_request_connect();
	}
	printk("Audio sink: %s%s\n", audio_sink_name(sink),
	       amp_sd_mode_ready ? "" : " (amp gate not configured)");
}

/*
 * {"type":"audio_sink","sink":"speaker"|"bluetooth"|"both"} — parsed with
 * the same bounded strstr discipline as the legacy control frames, AFTER
 * the exact-match recipe check for the same reason they are.
 */
static bool audio_sink_offer_frame(const char *frame)
{
	if (strstr(frame, "\"audio_sink\"") == NULL) {
		return false;
	}
	if (strstr(frame, "\"speaker\"") != NULL) {
		audio_sink_apply(AUDIO_SINK_SPEAKER);
	} else if (strstr(frame, "\"both\"") != NULL) {
		audio_sink_apply(AUDIO_SINK_BOTH);
	} else if (strstr(frame, "\"bluetooth\"") != NULL) {
		audio_sink_apply(AUDIO_SINK_BLUETOOTH);
	} else {
		printk("Audio sink frame with unknown sink — kept %s\n",
		       audio_sink_name(audio_sink_current));
	}
	return true;
}

#ifdef CONFIG_PENDANT_OFFLINE_STORE
static void mark_button_pressed(const struct device *port,
				struct gpio_callback *callback,
				gpio_port_pins_t pins)
{
	ARG_UNUSED(port);
	ARG_UNUSED(callback);
	ARG_UNUSED(pins);
	k_sem_give(&mark_press_sem);
}

