agenticaiuw/hivemind/firmware/nrf9160/src/main.c
	fs_file_t_init(&file);
	error = fs_open(&file, SD_RECORDING_PATH, FS_O_READ);
	if (error != 0) {
		printk("PCM_HEX_ERROR open=%d\n", error);
		return error;
	}

	printk("PCM_HEX_BEGIN\n");
	while (true) {
		ssize_t count = fs_read(&file, bytes, sizeof(bytes));

		if (count < 0) {
			error = (int)count;
			break;
		}
		if (count == 0) {
			error = 0;
			break;
		}

		for (size_t index = 0U; index < (size_t)count; ++index) {
			line[index * 2U] = digits[bytes[index] >> 4];
			line[index * 2U + 1U] = digits[bytes[index] & 0x0fU];
		}
		line[(size_t)count * 2U] = '\0';
		printk("%s\n", line);
		total += (uint32_t)count;
		/*
		 * The 115200-baud DK virtual UART needs about 8.5 ms to carry
		 * one full 48-byte hex line.  Pace this diagnostic stream so
		 * the interface MCU cannot drop bytes while draining printk.
		 */
		k_msleep(12);
	}
	(void)fs_close(&file);
	printk("PCM_HEX_END bytes=%u error=%d\n", total, error);
	return error;
}

struct sd_test_record {
	uint32_t magic;
	uint32_t boot_count;
	uint32_t checksum;
};

static uint32_t sd_test_checksum(const struct sd_test_record *record)
{
	return record->magic ^ record->boot_count ^ SD_TEST_CHECK_XOR;
}

static uint32_t integer_square_root(uint64_t value)
{
	uint64_t result = 0U;
	uint64_t bit = (uint64_t)1U << 62;

	while (bit > value) {
		bit >>= 2;
	}
	while (bit != 0U) {
		if (value >= result + bit) {
			value -= result + bit;
			result = (result >> 1) + bit;
		} else {
			result >>= 1;
		}
		bit >>= 2;
	}
	return (uint32_t)result;
}

static int test_sd_persistence(void)
{
	struct fs_file_t file;
	struct sd_test_record record = { 0 };
	int error;

	sd_persistence_verified = false;
	sd_boot_count = 0U;
	fs_file_t_init(&file);

	error = fs_open(&file, SD_TEST_PATH, FS_O_READ);
	sd_test_read_result = error;
	if (error == 0) {
		ssize_t bytes_read = fs_read(&file, &record, sizeof(record));

		sd_test_read_result = bytes_read == (ssize_t)sizeof(record)
			? 0 : (bytes_read < 0 ? (int)bytes_read : -EIO);
		(void)fs_close(&file);
		if (sd_test_read_result == 0 &&
		    record.magic == SD_TEST_MAGIC &&
		    record.checksum == sd_test_checksum(&record)) {
			sd_persistence_verified = true;
			sd_boot_count = record.boot_count;
		}
	}

	record.magic = SD_TEST_MAGIC;
	record.boot_count = sd_boot_count + 1U;
	record.checksum = sd_test_checksum(&record);

	fs_file_t_init(&file);
	error = fs_open(&file, SD_TEST_PATH,
			FS_O_CREATE | FS_O_WRITE | FS_O_TRUNC);
	if (error == 0) {
		ssize_t written = fs_write(&file, &record, sizeof(record));

		error = written == (ssize_t)sizeof(record)
			? fs_sync(&file)
			: (written < 0 ? (int)written : -EIO);
		int close_error = fs_close(&file);
		if (error == 0) {
			error = close_error;
		}
	}

	sd_test_write_result = error;
	if (error == 0) {
		sd_boot_count = record.boot_count;
	}
	return error;
}

static int write_pcm_frames(struct fs_file_t *file,
			    const int16_t *samples,
			    size_t frame_count)
{
	const uint8_t *bytes = (const uint8_t *)samples;
	size_t bytes_remaining = frame_count * sizeof(int16_t);

	while (bytes_remaining > 0U) {
		ssize_t written = fs_write(file, bytes, bytes_remaining);

		if (written < 0) {
			return (int)written;
		}
		if (written == 0) {
			return -EIO;
		}
		bytes += (size_t)written;
		bytes_remaining -= (size_t)written;
	}

	return 0;
}

#if PENDANT_BOOT_ENCODE_SELFTEST
/*
 * Write SELFTEST_SECONDS of a 125 Hz bipolar sawtooth to the card, then run
 * the real encoder over it.  The sawtooth is periodic and harmonically rich,
 * so SILK classifies every frame as voiced and takes both the stage-3 pitch
 * contour search and the delayed-decision quantizer - the two deepest stack
 * consumers in the codec.  Staging reuses mic_stage_samples, which is idle
 * outside capture, so this costs no RAM.
 */
static int encode_stack_selftest(void)
{
	struct fs_file_t file;
	struct pendant_opus_stats stats = { 0 };
	const uint32_t total_samples = SAMPLE_RATE * SELFTEST_SECONDS;
	uint32_t written_samples = 0U;
	int error;

	fs_file_t_init(&file);
	error = fs_open(&file, SD_SELFTEST_PCM_PATH,
			FS_O_CREATE | FS_O_WRITE | FS_O_TRUNC);
	if (error != 0) {
		printk("Selftest PCM open failed: %d\n", error);
		return error;
	}

	while (written_samples < total_samples) {
		size_t chunk = MIN((size_t)(total_samples - written_samples),
				   (size_t)MIC_STAGE_FRAMES);

		for (size_t index = 0U; index < chunk; ++index) {
			uint32_t phase = (written_samples + (uint32_t)index) %
					 SELFTEST_PITCH_PERIOD_SAMPLES;
			int32_t value =
				SELFTEST_AMPLITUDE -
				(int32_t)((2 * SELFTEST_AMPLITUDE * phase) /
					  SELFTEST_PITCH_PERIOD_SAMPLES);

			mic_stage_samples[index] = (int16_t)value;
		}
		error = write_pcm_frames(&file, mic_stage_samples, chunk);
		if (error != 0) {
			printk("Selftest PCM write failed: %d\n", error);
			(void)fs_close(&file);
			return error;
		}
		written_samples += (uint32_t)chunk;
	}
	error = fs_close(&file);
	if (error != 0) {
		printk("Selftest PCM close failed: %d\n", error);
		return error;
	}

	printk("ENCODE_SELFTEST_BEGIN samples=%u pitch_hz=%u\n",
	       total_samples, SAMPLE_RATE / SELFTEST_PITCH_PERIOD_SAMPLES);
	error = pendant_opus_encode_file(
		SD_SELFTEST_PCM_PATH, SD_SELFTEST_OPUS_PATH, SAMPLE_RATE,
		audio_workspace, sizeof(audio_workspace), &stats);
	printk("ENCODE_SELFTEST_END result=%d packets=%u in=%u out=%u\n",
	       error, stats.packets, stats.input_bytes, stats.output_bytes);
	report_main_stack_headroom("voiced selftest encode");
	return error;
}
#endif /* PENDANT_BOOT_ENCODE_SELFTEST */

/*
 * Configure one PWM instance as a free-running square wave: a single
 * duty value looped forever through the LOOPSDONE->SEQSTART0 shortcut.
 * The instance is armed but does not run until TASKS_SEQSTART[0] fires
 * over DPPI, so both clocks can start in the same PCLK16M cycle.
 */
static void mic_clock_pwm_arm(NRF_PWM_Type *pwm, uint32_t pin,
			      uint16_t countertop, const uint16_t *duty)
{
	nrf_gpio_pin_clear(pin);
	nrf_gpio_cfg_output(pin);

	uint32_t out_pins[NRF_PWM_CHANNEL_COUNT] = {
		pin, NRF_PWM_PIN_NOT_CONNECTED, NRF_PWM_PIN_NOT_CONNECTED,
		NRF_PWM_PIN_NOT_CONNECTED,
	};
	nrf_pwm_pins_set(pwm, out_pins);
	nrf_pwm_configure(pwm, NRF_PWM_CLK_16MHz, NRF_PWM_MODE_UP,
			  countertop);
	nrf_pwm_decoder_set(pwm, NRF_PWM_LOAD_COMMON, NRF_PWM_STEP_AUTO);
	nrf_pwm_seq_ptr_set(pwm, 0, duty);
	nrf_pwm_seq_cnt_set(pwm, 0, 1);
	nrf_pwm_seq_refresh_set(pwm, 0, 0);
	nrf_pwm_seq_end_delay_set(pwm, 0, 0);
	nrf_pwm_seq_ptr_set(pwm, 1, duty);
	nrf_pwm_seq_cnt_set(pwm, 1, 1);
	nrf_pwm_seq_refresh_set(pwm, 1, 0);
	nrf_pwm_seq_end_delay_set(pwm, 1, 0);
	nrf_pwm_loop_set(pwm, 1);
	nrf_pwm_shorts_set(pwm, NRF_PWM_SHORT_LOOPSDONE_SEQSTART0_MASK);
	nrf_pwm_enable(pwm);
}

