agenticaiuw/hivemind/firmware/nrf9160/src/main.c
static void mic_clock_pwm_release(NRF_PWM_Type *pwm, uint32_t pin)
{
	nrf_pwm_subscribe_clear(pwm, NRF_PWM_TASK_SEQSTART0);
	nrf_pwm_shorts_set(pwm, 0);
	nrf_pwm_event_clear(pwm, NRF_PWM_EVENT_STOPPED);
	nrf_pwm_task_trigger(pwm, NRF_PWM_TASK_STOP);
	for (uint32_t wait = 0U; wait < 1000U; ++wait) {
		if (nrf_pwm_event_check(pwm, NRF_PWM_EVENT_STOPPED)) {
			break;
		}
		k_busy_wait(1);
	}
	nrf_pwm_disable(pwm);
	/* Leave the pin high-impedance so the nets can be driven by the
	 * I2S master during playback without contention.
	 */
	nrf_gpio_cfg_default(pin);
}

static void mic_clocks_start(void)
{
	struct onoff_client cli;
	int res;

	mic_hfclk_mgr =
		z_nrf_clock_control_get_onoff(CLOCK_CONTROL_NRF_SUBSYS_HF);
	sys_notify_init_spinwait(&cli.notify);
	if (mic_hfclk_mgr != NULL &&
	    onoff_request(mic_hfclk_mgr, &cli) >= 0) {
		while (sys_notify_fetch_result(&cli.notify, &res) ==
		       -EAGAIN) {
			k_msleep(1);
		}
	} else {
		mic_hfclk_mgr = NULL;
	}

	/*
	 * Boot pinctrl leaves P0.17/P0.18 as master-mode outputs with
	 * their input buffers disconnected, and the I2S driver never
	 * touches pins again.  Turn them into undriven, buffer-connected
	 * inputs so the slave-mode peripheral can see the jumpered PWM
	 * clocks and the pads do not fight the PWM outputs.
	 */
	nrf_gpio_cfg_input(MIC_I2S_LRCK_PIN, NRF_GPIO_PIN_NOPULL);
	nrf_gpio_cfg_input(MIC_I2S_SCK_PIN, NRF_GPIO_PIN_NOPULL);

	mic_clock_pwm_arm(NRF_PWM1_NS, MIC_BCLK_PIN, MIC_BCLK_TOP,
			  mic_bclk_duty);
	mic_clock_pwm_arm(NRF_PWM2_NS, MIC_LRCLK_PIN, MIC_LRCLK_TOP,
			  mic_lrclk_duty);

	if (mic_dppi_channel < 0) {
		mic_dppi_channel = nrfx_gppi_channel_alloc(MIC_GPPI_NODE);
	}
	if (mic_dppi_channel >= 0) {
		uint8_t channel = (uint8_t)mic_dppi_channel;

		nrf_pwm_subscribe_set(NRF_PWM1_NS, NRF_PWM_TASK_SEQSTART0,
				      channel);
		nrf_pwm_subscribe_set(NRF_PWM2_NS, NRF_PWM_TASK_SEQSTART0,
				      channel);
		nrf_egu_publish_set(NRF_EGU2_NS, NRF_EGU_EVENT_TRIGGERED0,
				    channel);
		nrf_dppi_channels_enable(NRF_DPPIC_NS, BIT(channel));
		nrf_egu_task_trigger(NRF_EGU2_NS, NRF_EGU_TASK_TRIGGER0);
		k_busy_wait(10);
		nrf_dppi_channels_disable(NRF_DPPIC_NS, BIT(channel));
		nrf_egu_publish_clear(NRF_EGU2_NS, NRF_EGU_EVENT_TRIGGERED0);
	} else {
		/* No DPPI channel free: start sequentially.  The clocks
		 * stay frequency-locked either way; only the LRCLK-to-BCLK
		 * phase is then unverified.
		 */
		printk("MIC clock warning: no DPPI channel, sequential "
		       "start\n");
		nrf_pwm_task_trigger(NRF_PWM1_NS, NRF_PWM_TASK_SEQSTART0);
		nrf_pwm_task_trigger(NRF_PWM2_NS, NRF_PWM_TASK_SEQSTART0);
	}
}

static void mic_clocks_stop(void)
{
	mic_clock_pwm_release(NRF_PWM1_NS, MIC_BCLK_PIN);
	mic_clock_pwm_release(NRF_PWM2_NS, MIC_LRCLK_PIN);

	/* Restore the boot pinctrl's master-mode state (output low,
	 * input buffer disconnected) so I2S playback drives the bus
	 * exactly as before.
	 */
	nrf_gpio_pin_clear(MIC_I2S_LRCK_PIN);
	nrf_gpio_cfg_output(MIC_I2S_LRCK_PIN);
	nrf_gpio_pin_clear(MIC_I2S_SCK_PIN);
	nrf_gpio_cfg_output(MIC_I2S_SCK_PIN);

	if (mic_hfclk_mgr != NULL) {
		(void)onoff_release(mic_hfclk_mgr);
		mic_hfclk_mgr = NULL;
	}
}

#if PENDANT_MIC_ELECTRICAL_PROBE
static void probe_mic_data_pull(const char *label, nrf_gpio_pin_pull_t pull)
{
	uint32_t ones = 0U;
	uint32_t transitions = 0U;
	uint32_t previous = 0U;

	nrf_gpio_cfg_input(MIC_DATA_PIN, pull);
	k_busy_wait(50);

	for (uint32_t captured = 0U; captured < MIC_RAW_PROBE_BITS;
	     ++captured) {
		uint32_t bit = nrf_gpio_pin_read(MIC_DATA_PIN);

		ones += bit;
		if (captured > 0U && bit != previous) {
			++transitions;
		}
		previous = bit;
		k_busy_wait(2);
	}

	printk("MIC DOUT electrical probe: pull=%s bits=%u ones=%u "
	       "transitions=%u\n",
	       label, MIC_RAW_PROBE_BITS, ones, transitions);
}

/* Run with the PWM clocks live, before I2S RX claims the data pin. */
static void probe_mic_data_driver(void)
{
	probe_mic_data_pull("none", NRF_GPIO_PIN_NOPULL);
	probe_mic_data_pull("up", NRF_GPIO_PIN_PULLUP);
	probe_mic_data_pull("down", NRF_GPIO_PIN_PULLDOWN);
	nrf_gpio_cfg_input(MIC_DATA_PIN, NRF_GPIO_PIN_NOPULL);
}
#endif

static int record_microphone(const struct device *i2s, size_t sample_limit)
{
	struct i2s_config config = {
		.word_size = 24U,
		.channels = 1U,
		.format = I2S_FMT_DATA_FORMAT_I2S,
		.options = I2S_OPT_BIT_CLK_TARGET | I2S_OPT_FRAME_CLK_TARGET,
		.frame_clk_freq = MIC_FRAME_RATE,
		.mem_slab = &mic_rx_slab,
		.block_size = MIC_RX_BLOCK_SIZE,
		.timeout = 1500,
	};
	const size_t effective_sample_limit = sample_limit;
	size_t sample_index = 0U;
	size_t stage_frames = 0U;
	uint32_t stage_flush_count = 0U;
	size_t next_trace_sample = SAMPLE_RATE;
	size_t block_index = 0U;
	uint64_t square_sum = 0U;
	/* Copy each completed DMA block here and return its slab immediately. */
	int32_t raw_processing[MIC_RX_BLOCK_FRAMES];
	uint32_t zero_crossings = 0U;
	int16_t minimum_sample = INT16_MAX;
	int16_t maximum_sample = INT16_MIN;
	int16_t previous_sample = 0;
	bool have_previous_sample = false;
	int32_t hpf_prev_in = 0;
	int32_t hpf_prev_out = 0;
	bool hpf_primed = false;
	int32_t slew_prev = 0;
	bool slew_primed = false;
	int64_t clocks_started_at;
	int64_t settle_elapsed;
	int64_t next_led_toggle;
	int error;

	/*
	 * Latency path: live LTE when prewarmed + microSD backup always.
	 * Prewarm TLS while idle; press = mic + ring (+ SD for fallback).
	 */
	struct fs_file_t sd_file;
	bool sd_open = false;
	bool live_fail_logged = false;
	int live_write_error = 0;

	recording_on_sd = false;
	live_stream_failed = false;
	live_tx_saturated = false;
	live_fifo_reset();
	if (sample_limit == 0U) {
		return -ENODEV;
	}
	/*
	 * Re-validate/reopen idle prewarm before I2S (stale sockets → -104) —
	 * unless this capture is deliberately radio-off. A push-to-talk
	 * question is captured with the modem untouched and uploaded once
	 * afterwards; opening a TLS socket here would spend the RRC connection
	 * this mode exists to avoid, seconds before there is anything to send.
	 */
	if (capture_radio_off) {
		printk("Capture with the radio off (push-to-talk): journaling "
		       "to microSD, one upload after the stop press\n");
	} else if (pendant_cloud_stream_ensure(PENDANT_OPUS_SAMPLE_RATE) != 0) {
		printk("Live stream ensure failed — recording to microSD "
		       "(fallback single-shot after stop)\n");
	}
	bool live_encoder_ok = false;

	if (pendant_cloud_stream_active()) {
		live_encoder_ok = pendant_opus_stream_begin_packets(
					  SAMPLE_RATE, audio_workspace,
					  OPUS_TX_ARENA_BYTES,
					  live_opus_packet_sink) == 0;
		if (!live_encoder_ok) {
			printk("Live Opus encoder init failed — falling back "
			       "to microSD journal\n");
			pendant_cloud_stream_abort();
		}
	}
	error = k_mem_slab_init(&mic_rx_slab, mic_rx_storage,
				MIC_RX_BLOCK_SIZE, MIC_RX_BLOCK_COUNT);
	if (error != 0) {
		return error;
	}

	/* Button press = record NOW. LED + mic; LTE drains ring between I2S.
	 * One call covers memo, push-to-talk AND the legacy command capture:
	 * every one of them reaches the microphone through this function, so
	 * this is the single place "the mic is live" becomes true. */
	pendant_status_set(PENDANT_STATUS_RECORDING);
	gpio_pin_set_dt(&led, 1);
	next_led_toggle = k_uptime_get() + 250;
	mic_clocks_start();
	clocks_started_at = k_uptime_get();

	fs_file_t_init(&sd_file);
	if (live_encoder_ok) {
		/*
		 * Live LTE path is up: keep every SD write out of the hot
		 * capture loop (an SD stall can back-pressure the ring and
		 * kill the live stream it was insuring). If the stream dies
		 * mid-utterance the cycle fast-fails (-EIO, error flashes) and
		 * that utterance is lost — the early frames were never stored,
		 * so a late journal would upload a beheaded recording.
		 */
	} else if (sd_ready) {
		/* No live path at press — journal from the first frame. */
		error = fs_open(&sd_file, SD_RECORDING_PATH,
				FS_O_CREATE | FS_O_WRITE | FS_O_TRUNC);
		if (error != 0) {
			printk("microSD open failed (%d) and no live stream\n",
			       error);
			mic_clocks_stop();
			gpio_pin_set_dt(&led, 0);
			return error;
		}
		sd_open = true;
		recording_on_sd = true;
	} else {
		mic_clocks_stop();
		gpio_pin_set_dt(&led, 0);
		printk("No live stream and no microSD — cannot record\n");
		return -ENOTCONN;
	}

	recorded_samples = 0U;
	recorded_peak = 0U;
	recording_absolute_sum = 0U;
	recording_stopped_by_button = false;

	/* Stage level tracking (diagnostics only — recording stops ONLY on a
	 * second button press or the 30 s cap; the cloud's semantic VAD owns
	 * end-of-utterance detection now). */
	uint32_t stage_abs_sum = 0U;
	uint32_t noise_floor_mean = UINT32_MAX;
	uint32_t voiced_stage_count = 0U;
	uint32_t silent_stage_count = 0U;

	error = i2s_configure(i2s, I2S_DIR_RX, &config);
	if (error != 0) {
		mic_clocks_stop();
		if (sd_open) {
			(void)fs_close(&sd_file);
			recording_on_sd = false;
		}
		gpio_pin_set_dt(&led, 0);
		return error;
	}

	settle_elapsed = k_uptime_get() - clocks_started_at;
	if (settle_elapsed < MIC_POWERUP_BUDGET_MS) {
		k_msleep(MIC_POWERUP_BUDGET_MS - (int32_t)settle_elapsed);
	}
#if PENDANT_MIC_ELECTRICAL_PROBE
	probe_mic_data_driver();
#endif
	printk("I2S mic record: bclk_hz=%u lrclk_hz=%u pcm_rate_hz=%u "
	       "live_opus=%d fifo_bytes=%u sd=%d\n",
	       16000000U / MIC_BCLK_TOP, 16000000U / MIC_LRCLK_TOP,
	       SAMPLE_RATE, live_encoder_ok ? 1 : 0,
	       (unsigned int)OPUS_TX_FIFO_BYTES, sd_open ? 1 : 0);

	error = i2s_trigger(i2s, I2S_DIR_RX, I2S_TRIGGER_START);
	if (error != 0) {
		mic_clocks_stop();
		if (sd_open) {
			(void)fs_close(&sd_file);
			recording_on_sd = false;
		}
		gpio_pin_set_dt(&led, 0);
		return error;
	}

	printk("I2S mic live: sample_limit=%u\n",
	       (uint32_t)effective_sample_limit);

	while (sample_index < effective_sample_limit) {
		void *block;
		size_t size;

		error = i2s_read(i2s, &block, &size);
		if (error != 0) {
			printk("I2S mic read failed: samples=%u error=%d\n",
			       (uint32_t)sample_index, error);
			(void)i2s_trigger(i2s, I2S_DIR_RX, I2S_TRIGGER_DROP);
			k_msleep(MIC_STOP_SETTLE_MS);
			mic_clocks_stop();
			if (sd_open) {
				(void)fs_close(&sd_file);
				recording_on_sd = false;
			}
			return error;
		}

		if (size > sizeof(raw_processing) ||
		    (size % sizeof(raw_processing[0])) != 0U) {
			k_mem_slab_free(&mic_rx_slab, block);
			printk("I2S mic invalid RX block: bytes=%u capacity=%u\n",
			       (uint32_t)size, (uint32_t)sizeof(raw_processing));
			(void)i2s_trigger(i2s, I2S_DIR_RX, I2S_TRIGGER_DROP);
			k_msleep(MIC_STOP_SETTLE_MS);
			mic_clocks_stop();
			if (sd_open) {
				(void)fs_close(&sd_file);
				recording_on_sd = false;
			}
			return -EMSGSIZE;
		}
		memcpy(raw_processing, block, size);
		k_mem_slab_free(&mic_rx_slab, block);

		int32_t *raw = raw_processing;
		size_t raw_frames = size / sizeof(int32_t);

		if (block_index == 0U) {
			int32_t raw_min = INT32_MAX;
			int32_t raw_max = INT32_MIN;

			for (size_t index = 0U; index < raw_frames; ++index) {
				raw_min = MIN(raw_min, raw[index]);
				raw_max = MAX(raw_max, raw[index]);
			}
			printk("I2S mic raw block0: words=%u min=%d max=%d\n",
			       (uint32_t)raw_frames, raw_min, raw_max);
		}

		if (block_index < MIC_STARTUP_SKIP_BLOCKS) {
			++block_index;
			clear_button_events();
			continue;
		}
		++block_index;

		size_t out_frames = raw_frames / MIC_DECIMATION;

		out_frames = MIN(out_frames,
				 effective_sample_limit - sample_index);

		for (size_t frame = 0U; frame < out_frames; ++frame) {
			/*
			 * Each RX word is a right-aligned, sign-extended
			 * 24-bit sample; the SPH0645's 18 significant bits
			 * occupy the top of that window.  Average adjacent
			 * frames (crude low-pass) while halving the rate,
			 * then scale 24-bit down to 16-bit.
			 */
			int32_t first =
				raw[frame * MIC_DECIMATION] >> MIC_SAMPLE_SHIFT;
			int32_t second =
				raw[frame * MIC_DECIMATION + 1U] >>
				MIC_SAMPLE_SHIFT;

			if (!slew_primed) {
				slew_prev = first;
				slew_primed = true;
			}
			int32_t delta = first - slew_prev;

			delta = CLAMP(delta, -MIC_SLEW_LIMIT, MIC_SLEW_LIMIT);
			slew_prev += delta;
			first = slew_prev;
			delta = second - slew_prev;
			delta = CLAMP(delta, -MIC_SLEW_LIMIT, MIC_SLEW_LIMIT);
			slew_prev += delta;
			second = slew_prev;

