agenticaiuw/hivemind/firmware/nrf9160/src/main.c
			int32_t sample = ((first + second) / 2) >> 8;

			/* DC blocker: the SPH0645 sits about 5% off center. */
			if (!hpf_primed) {
				hpf_prev_in = sample;
				hpf_primed = true;
			}
			int32_t filtered = sample - hpf_prev_in +
				(int32_t)(((int64_t)MIC_HPF_COEFF_Q15 *
					   hpf_prev_out) >> 15);
			hpf_prev_in = sample;
			hpf_prev_out = filtered;

			int32_t amplified = filtered * MIC_GAIN;

			amplified = CLAMP(amplified, INT16_MIN, INT16_MAX);

			int32_t absolute =
				amplified < 0 ? -amplified : amplified;

			mic_stage_samples[stage_frames] = (int16_t)amplified;
			stage_abs_sum += (uint32_t)absolute;
			if (++stage_frames == MIC_STAGE_FRAMES) {
				if (sd_open) {
					live_write_error = write_pcm_frames(
						&sd_file, mic_stage_samples,
						MIC_STAGE_FRAMES);
					if (live_write_error != 0) {
						printk("microSD stage write failed: %d\n",
						       live_write_error);
						(void)fs_close(&sd_file);
						sd_open = false;
						recording_on_sd = false;
						live_write_error = 0;
					}
				}
				live_tx_offer_stage(mic_stage_samples,
						    MIC_STAGE_FRAMES);
				stage_frames = 0U;
				++stage_flush_count;

				/*
				 * End-of-utterance: floor tracks the quietest
				 * stage; voiced/silent split rides that floor,
				 * so levels self-calibrate per press.
				 */
				uint32_t stage_mean =
					stage_abs_sum / MIC_STAGE_FRAMES;

				stage_abs_sum = 0U;
				noise_floor_mean = MIN(noise_floor_mean,
						       MAX(stage_mean, 8U));
				/* Calibrated on a real press (capture
				 * job_bff5bd08): speech runs only ~2-5x the
				 * amplified noise floor, so demand 1.5x plus
				 * an absolute margin, not the 4x that scored
				 * a clean transcribed sentence as silence. */
				if (stage_mean >
				    noise_floor_mean +
					    MAX(noise_floor_mean / 2U, 120U)) {
					++voiced_stage_count;
					silent_stage_count = 0U;
				} else if (stage_mean <
					   noise_floor_mean +
						   MAX(noise_floor_mean / 4U,
						       60U)) {
					++silent_stage_count;
				}
				if (live_tx_saturated) {
					break;
				}
				/* Live mid-fail is OK if SD still capturing. */
				if (live_stream_failed && !sd_open) {
					break;
				}
			}
			minimum_sample = MIN(minimum_sample,
					     (int16_t)amplified);
			maximum_sample = MAX(maximum_sample,
					     (int16_t)amplified);
			square_sum += (uint64_t)((int64_t)amplified *
						 amplified);
			if (have_previous_sample &&
			    ((previous_sample < 0 && amplified >= 0) ||
			     (previous_sample >= 0 && amplified < 0))) {
				++zero_crossings;
			}
			previous_sample = (int16_t)amplified;
			have_previous_sample = true;
			recorded_peak = MAX(recorded_peak,
					    (uint16_t)MIN(absolute,
							  UINT16_MAX));
			recording_absolute_sum += (uint32_t)absolute;

			++sample_index;
		}

		recorded_samples = sample_index;
		if (live_stream_failed && !sd_open) {
			printk("I2S mic live LTE stream failed mid-capture "
			       "(no SD backup)\n");
			(void)i2s_trigger(i2s, I2S_DIR_RX, I2S_TRIGGER_DROP);
			k_msleep(MIC_STOP_SETTLE_MS);
			mic_clocks_stop();
			if (sd_open) {
				(void)fs_close(&sd_file);
				recording_on_sd = false;
			}
			return -EIO;
		}
		if (live_stream_failed && sd_open && !live_fail_logged) {
			printk("Live LTE failed mid-capture; continuing on microSD\n");
			live_fail_logged = true;
		}

		/* Spend a few free ms pushing PCM over LTE between DMA blocks. */
		if (!live_stream_failed) {
			live_tx_pump(PCM_TX_PUMP_BUDGET_MS);
		}

		if (sample_index >= next_trace_sample) {
			next_trace_sample += SAMPLE_RATE;
		}

		if (k_uptime_get() >= next_led_toggle) {
			gpio_pin_toggle_dt(&led);
			next_led_toggle = k_uptime_get() + 250;
		}

		if (live_tx_saturated) {
			printk("Utterance clipped: uplink fell ~4 s behind\n");
			break;
		}

		/*
		 * Ignore bounce / leftover edges from the start press for the
		 * first second, then a second press stops recording.
		 *
		 * The button that STARTED a recording is the one that stops it,
		 * and after the 2026-08-13 remap that is a different button
		 * than it used to be: a memo now starts on BLUE (it was green),
		 * and a push-to-talk question now starts on a long YELLOW hold
		 * (it was blue). Yellow already stops everything through
		 * button_press_sem, so push-to-talk needs no clause of its own
		 * — it inherits the general one. Blue keeps its clause so a
		 * memo answers to the button the owner actually pressed, and
		 * still can never cut a command capture short.
		 */
		if (sample_index < MIC_MIN_RECORD_FRAMES) {
			clear_button_events();
			if (memo_capture_active) {
				clear_blue_events();
			}
		} else if (k_sem_take(&button_press_sem, K_NO_WAIT) == 0 ||
			   (memo_capture_active && take_blue_press())) {
			recording_stopped_by_button = true;
			/*
			 * Acknowledge on the EDGE, not after teardown: the
			 * red light goes out and the exit tick fires here,
			 * together, because leaving RECORDING is ONE
			 * transition and pendant_status_set is the only
			 * thing allowed to make it.
			 *
			 * This replaces the old tick-for-memo /
			 * click-for-command split. Every capture now closes
			 * the same way, which is the point: the owner should
			 * not have to remember which button they pressed to
			 * know what a buzz meant.
			 */
			pendant_status_set(PENDANT_STATUS_THINKING);
			break;
		}
	}

	error = i2s_trigger(i2s, I2S_DIR_RX, I2S_TRIGGER_DROP);
	k_msleep(MIC_STOP_SETTLE_MS);
	mic_clocks_stop();
	if (recording_stopped_by_button) {
		finish_button_press();
	}

	if (stage_frames > 0U) {
		if (sd_open) {
			live_write_error = write_pcm_frames(
				&sd_file, mic_stage_samples, stage_frames);
			if (live_write_error != 0) {
				printk("microSD final stage write failed: %d\n",
				       live_write_error);
			}
		}
		/* Pad last stream slot so the fixed-size ring accepts it. */
		while (stage_frames < MIC_STAGE_FRAMES) {
			mic_stage_samples[stage_frames++] = 0;
		}
		live_tx_offer_stage(mic_stage_samples, MIC_STAGE_FRAMES);
	}

	if (sd_open) {
		int sync_error = fs_sync(&sd_file);
		int close_error = fs_close(&sd_file);

		sd_open = false;
		if (sync_error != 0 || close_error != 0) {
			printk("microSD close failed: sync=%d close=%d\n",
			       sync_error, close_error);
			recording_on_sd = false;
		}
	}

