agenticaiuw/hivemind/firmware/nrf9160/src/main.c
	/* Finalize the live encoder (flushes the last partial packet through
	 * the sink), then drain the FIFO — it can hold ~6 s of encoded audio;
	 * give a weak uplink time to move it. */
	if (pendant_opus_stream_active()) {
		struct pendant_opus_stats live_stats = { 0 };
		int end_error = pendant_opus_stream_end(&live_stats);

		if (end_error != 0) {
			printk("Live Opus finalize failed: %d\n", end_error);
		} else {
			printk("Live Opus: packets=%u bytes=%u\n",
			       live_stats.packets, live_stats.output_bytes);
		}
	}
	if (pendant_cloud_stream_active() && !live_stream_failed) {
		int64_t drain_until = k_uptime_get() + 6000;

		live_tx_flush = true;
		while ((live_fifo_fill() > 0U ||
			pendant_cloud_stream_has_pending()) &&
		       pendant_cloud_stream_active() && !live_stream_failed &&
		       k_uptime_get() < drain_until) {
			live_tx_pump(PCM_TX_DRAIN_BUDGET_MS);
		}
		if (live_stream_failed || !pendant_cloud_stream_active()) {
			printk("Live TX incomplete — will use SD fallback if present\n");
			pendant_cloud_stream_abort();
			live_stream_failed = true;
			live_fifo_reset();
		} else if (pendant_cloud_stream_has_pending()) {
			/* A half-sent HTTP chunk cannot be abandoned without
			 * corrupting the chunked framing — abort cleanly. */
			printk("Live TX pending chunk stuck; abort stream\n");
			pendant_cloud_stream_abort();
			live_stream_failed = true;
			live_fifo_reset();
		} else if (live_fifo_fill() > 0U) {
			/* Socket healthy but slow: clip the utterance tail and
			 * let the model answer on what arrived. */
			printk("Live TX drain timeout; clipping %u undelivered "
			       "bytes\n",
			       (uint32_t)live_fifo_fill());
			live_fifo_reset();
		}
	}

	/* Capture itself succeeded if we have samples (live and/or SD). */
	error = (recorded_samples > 0U) ? 0 : (error != 0 ? error : -ENODATA);

	uint32_t rms = recorded_samples == 0U
		? 0U
		: integer_square_root(square_sum / recorded_samples);
	printk("I2S mic capture totals: samples=%u mean=%u peak=%u rms=%u "
	       "min=%d max=%d zero_crossings=%u sd_flushes=%u "
	       "live_sent=%u fifo_left=%u saturated=%d "
	       "stream_failed=%d\n",
	       recorded_samples,
	       recorded_samples == 0U
		       ? 0U
		       : (uint32_t)(recording_absolute_sum /
				    recorded_samples),
	       recorded_peak, rms, minimum_sample, maximum_sample,
	       zero_crossings, stage_flush_count,
	       pendant_cloud_stream_bytes_sent(),
	       (uint32_t)live_fifo_fill(), live_tx_saturated ? 1 : 0,
	       live_stream_failed ? 1 : 0);
	return error;
}


static void show_error(void)
{
	/*
	 * Say it on the colour channel too, when there is one.  This call is
	 * a no-op until pendant_status_init() has run (see status_ready in
	 * pendant_status.c), which is why that init was moved above every
	 * fatal path that can be reached on a working board: an SD card that
	 * will not mount is the failure this device actually hits, and before
	 * that move it produced a pendant whose status LED was never
	 * initialised at all — indistinguishable, to the owner, from a
	 * miswired LED.
	 *
	 * Asserted ONCE, not in the loop: FAILED is three red blinks plus a
	 * two-part buzz, and a wearable that buzzes every second forever on a
	 * bench is worse than one that says it clearly once.  The 100 ms LED1
	 * blink below remains the permanent "this boot is dead" marker.
	 */
	pendant_status_set(PENDANT_STATUS_FAILED);
	while (true) {
		gpio_pin_toggle_dt(&led);
		/*
		 * THE BENCH KEEPS REPORTING FROM INSIDE A DEAD BOOT.
		 *
		 * This is the loop a pendant with no usable microSD actually
		 * sits in, and it is the exact state in which the owner most
		 * needs to see their wires: a board that failed to boot is a
		 * board somebody is about to go poking at. Measured on this
		 * bench 2026-08-13 — the app reached here 320 ms after reset
		 * and stayed, so every control tile on the dashboard had one
		 * boot sample and then aged out forever, which reads as "the
		 * board went away" rather than "the board is parked".
		 *
		 * Both calls are safe here by construction: volume_poll is one
		 * bounded SAADC read whose only side effects are a gain word
		 * and a report atomic that nothing is consuming yet (the WS
		 * thread is not created until after this function's callers),
		 * and pendant_bench_tick only reads pads and prints. Neither
		 * can resurrect the boot, and neither is supposed to.
		 */
		volume_poll();
		pendant_bench_tick();
		k_msleep(100);
	}
}

/* ---- Full-duplex conversation ---- */

static inline size_t dl_jitter_fill(void)
{
	return (dl_jitter_head - dl_jitter_tail + DL_JITTER_SAMPLES) %
	       DL_JITTER_SAMPLES;
}

static void dl_jitter_reset(void)
{
	dl_jitter_head = 0U;
	dl_jitter_tail = 0U;
}

static void dl_jitter_put(const int16_t *samples, size_t count)
{
	/* One slot stays unused so full != empty. The receive gate makes
	 * overflow unreachable in normal operation; a misbehaving relay
	 * (dense DTX frames) must clip, not corrupt. */
	size_t free_samples = DL_JITTER_SAMPLES - 1U - dl_jitter_fill();
	size_t head = dl_jitter_head;

	if (count > free_samples) {
		count = free_samples;
	}
	for (size_t i = 0U; i < count; ++i) {
		dl_jitter[head] = samples[i];
		head = (head + 1U) % DL_JITTER_SAMPLES;
	}
	/* Samples land before the consumer can see them. */
	compiler_barrier();
	dl_jitter_head = head;
}

/*
 * Adaptive duplex uplink, evaluated once per mic block from the conversation
 * loop. See the CONVO_UPLINK_* block above for why: the radio cannot carry the
 * uplink while agent audio is coming down, so trying to push a full-rate mic
 * stream through it only fills the FIFO until the user's next question falls
 * off the end.
 *
 * "Playing" is the same signal the LED uses (agent audio buffered), plus a
 * hangover so the gaps between downlink frames do not retune the encoder every
 * block.
 */
static void convo_update_uplink_adapt(void)
{
	int64_t now = k_uptime_get();
	size_t fill = live_fifo_fill();
	bool dl_playing;

