agenticaiuw/hivemind/firmware/nrf9160/src/main.c
	/* Bill the interval that just closed to the state it actually ran in,
	 * before that state is allowed to change. */
	if (convo_adapt_last_ms != 0 && convo_uplink_ducked) {
		convo_uplink_duck_ms += (uint32_t)(now - convo_adapt_last_ms);
	}
	convo_adapt_last_ms = now;

	if (dl_jitter_fill() > 0U) {
		convo_dl_active_until = now + CONVO_DL_ACTIVE_HANGOVER_MS;
	}
	dl_playing = now < convo_dl_active_until;

	if (dl_playing != convo_uplink_ducked) {
		/* Only latch the new state if the encoder took it, so a failed
		 * ctl cannot leave the uplink ducked for the whole call. */
		if (pendant_opus_stream_set_bitrate(
			    dl_playing ? CONVO_UPLINK_DUCK_BPS
				       : PENDANT_OPUS_BITRATE) == 0) {
			convo_uplink_ducked = dl_playing;
		}
	}

	/* Hysteresis, and an unconditional release the moment playback ends —
	 * whatever the user says next is the whole point of the reserve. */
	if (!dl_playing || fill <= CONVO_UPLINK_RESUME_BYTES) {
		convo_uplink_holding = false;
	} else if (fill >= CONVO_UPLINK_HOLD_BYTES) {
		convo_uplink_holding = true;
	}
}

/*
 * ---- 24000 -> 31250 anti-imaging interpolator ----
 *
 * 24000/31250 reduces to 96/125 and gcd(96,125) == 1, so the phase
 * accumulator visits every one of the 125 residues: the 125-phase table in
 * tx_resample_taps.h is EXACT, and unlike the ESP32's 625/882 stage there is
 * nothing to blend between neighbouring phases.
 *
 * The straight-line interpolator this replaces had a sinc^2 kernel whose
 * SECOND image (24000 + f) folds around the 31250 output rate to |7250 - f|.
 * Measured on the bench: every tone from 5 to 10 kHz left a companion at
 * -21 to -31 dBc down in the low midrange -- so every "s", "sh" and "f" in
 * the agent's voice rang a buzz at a few percent of full scale, at a
 * frequency that moves DOWN as the voice moves up. Inharmonic, frequency
 * inverted, and squarely where the ear is most sensitive. That is the
 * distortion, and it is now -58 to -77 dBc.
 *
 * Cutoff is 10.5 kHz, not the 12 kHz the decoder can carry: at 125/96 an
 * 11.9 kHz component images to 12.1 kHz and no filter separates them.
 *
 * The table is const in flash. The app is built soft-float (CONFIG_FPU is
 * not set), so generating it at boot would drag in softfloat sinf/cosf and
 * spend RAM the audio path does not have.
 */
static int16_t tx_fir_hist[2U * TX_FIR_TAPS]; /* written twice so the tap
					       * window is always contiguous:
					       * no shift in the hot loop */
static size_t tx_fir_pos;
static uint32_t tx_fir_zero_run = TX_FIR_TAPS;
static uint32_t tx_phase; /* 0..TX_RESAMPLE_DEN-1 */

static void tx_resample_reset(void)
{
	tx_phase = 0U;
	tx_fir_pos = 0U;
	tx_fir_zero_run = TX_FIR_TAPS;
	memset(tx_fir_hist, 0, sizeof(tx_fir_hist));
}

static inline void tx_fir_push(int16_t sample)
{
	tx_fir_pos = (tx_fir_pos == 0U) ? (TX_FIR_TAPS - 1U)
					: (tx_fir_pos - 1U);
	tx_fir_hist[tx_fir_pos] = sample;
	tx_fir_hist[tx_fir_pos + TX_FIR_TAPS] = sample;
	if (sample == 0) {
		if (tx_fir_zero_run < TX_FIR_TAPS) {
			++tx_fir_zero_run;
		}
	} else {
		tx_fir_zero_run = 0U;
	}
}

/*
 * One polyphase output sample at the current tx_phase from the shared FIR
 * history.  Split out of convo_fill_tx_block so the reflex chime (16 kHz
 * source, same 125-phase table, NUM=64) reuses the identical arithmetic —
 * the two paths never run concurrently (the chime plays only while idle).
 */
static inline int32_t tx_fir_convolve(void)
{
	const int16_t *row = &tx_fir_coeff[tx_phase * TX_FIR_TAPS];
	const int16_t *window = &tx_fir_hist[tx_fir_pos];
	int32_t acc = 0;

	for (size_t tap = 0U; tap < TX_FIR_TAPS; ++tap) {
		acc += (int32_t)row[tap] * (int32_t)window[tap];
	}
	acc = (acc + (1 << (TX_FIR_Q - 1))) >> TX_FIR_Q;
	/* Sum|h| peaks at 1.651, so a transient can ring past
	 * full scale even though the decoder never does. */
	return CLAMP(acc, INT16_MIN, INT16_MAX);
}

/*
 * Volume applies HERE, at the moment a sample becomes a wire word, and
 * only to AUDIO words: the sync preamble (convo_queue_preamble) must reach
 * the ESP32 bit-exact or it never locks.  Downstream of this multiply the
 * wire itself carries pre-scaled PCM, so the ESP32 — and whatever dumb
 * Bluetooth module replaces it — plays the right level with no knowledge
 * of the knob; the MAX98357A tap gets the same scaling for free.
 * convo_tx_peak is measured BEFORE this (in the callers, off the clean
 * convolver output), so diagnostics keep seeing what the decoder produced.
 * gain <= unity (Q12 attenuator), input already clamped to int16: the
 * product cannot exceed full scale, hence no saturation step.
 */
static inline int32_t tx_apply_volume(int32_t sample)
{
	return (sample * (int32_t)atomic_get(&volume_gain_q12)) >> 12;
}

/*
 * Fill one TX block (640 words at 31250) from the 24 kHz jitter ring.
 * `*playing` implements the prebuffer/rebuffer gate; silence flows whenever
 * it is off so the duplex transfer never underruns. Filter state persists
 * across blocks.
 */
static void convo_fill_tx_block(int32_t *words, bool *playing)
{
	for (size_t frame = 0U; frame < CONVO_TX_BLOCK_FRAMES; ++frame) {
		int32_t value = 0;

		if (!*playing && dl_jitter_fill() >= DL_PREBUFFER_SAMPLES) {
			*playing = true;
		}
		/* A fully zeroed history convolves to exactly zero at every
		 * phase, so silence costs nothing. */
		if (tx_fir_zero_run < TX_FIR_TAPS) {
			uint32_t magnitude;

			value = tx_fir_convolve();
			magnitude = (uint32_t)(value < 0 ? -value : value);
			if (magnitude > convo_tx_peak) {
				convo_tx_peak = magnitude;
			}
			value = tx_apply_volume(value);
		}
		words[frame] = value << 8;

		tx_phase += TX_RESAMPLE_NUM;
		if (tx_phase >= TX_RESAMPLE_DEN) {
			tx_phase -= TX_RESAMPLE_DEN;
			if (*playing && dl_jitter_fill() > 0U) {
				tx_fir_push(dl_jitter[dl_jitter_tail]);
				dl_jitter_tail = (dl_jitter_tail + 1U) %
						 DL_JITTER_SAMPLES;
				convo_tx_dry = false;
			} else {
				tx_fir_push(0);
				if (*playing && !convo_tx_dry) {
					convo_tx_dry = true;
					++convo_tx_starved;
				}
			}
		}
	}
}

