agenticaiuw/hivemind/firmware/nrf9160/src/main.c
static struct {
	size_t note; /* == ARRAY_SIZE(chime_notes) when finished */
	uint32_t pos;
	int32_t y1;
	int32_t y2;
} chime_synth;

static void chime_synth_reset(void)
{
	chime_synth.note = 0U;
	chime_synth.pos = 0U;
	chime_synth.y1 = chime_notes[0].seed;
	chime_synth.y2 = 0;
}

/* Next 16 kHz source sample; digital silence forever once the last note
 * ends, so the FIR tail and the block margin flush to true zero. */
static int16_t chime_next_sample(void)
{
	const struct chime_note *note;
	int32_t value;
	int32_t next;
	uint32_t edge;

	if (chime_synth.note >= ARRAY_SIZE(chime_notes)) {
		return 0;
	}
	note = &chime_notes[chime_synth.note];
	value = chime_synth.y1;
	/* k*y1 peaks near 9200*31677 ≈ 2.9e8 — comfortably inside int32. */
	next = ((note->k_q14 * chime_synth.y1) >> 14) - chime_synth.y2;
	chime_synth.y2 = chime_synth.y1;
	chime_synth.y1 = next;

	edge = MIN(chime_synth.pos, note->samples - 1U - chime_synth.pos);
	if (edge < CHIME_FADE_SAMPLES) {
		value = value * (int32_t)edge / (int32_t)CHIME_FADE_SAMPLES;
	}

	if (++chime_synth.pos >= note->samples) {
		++chime_synth.note;
		chime_synth.pos = 0U;
		if (chime_synth.note < ARRAY_SIZE(chime_notes)) {
			chime_synth.y1 = chime_notes[chime_synth.note].seed;
			chime_synth.y2 = 0;
		}
	}
	return (int16_t)CLAMP(value, INT16_MIN, INT16_MAX);
}

/* Twin of convo_fill_tx_block with the jitter ring replaced by the synth
 * and the phase step at 64/125.  Shares tx_phase/tx_fir state — both users
 * reset it at their own start and never overlap. */
static void chime_fill_tx_block(int32_t *words)
{
	for (size_t frame = 0U; frame < CONVO_TX_BLOCK_FRAMES; ++frame) {
		int32_t value = 0;

		if (tx_fir_zero_run < TX_FIR_TAPS) {
			/* Chimes obey the knob too — on the ESP32 the gain sat
			 * at the single wire consumer, so every sound scaled;
			 * moving the knob here keeps that behavior. */
			value = tx_apply_volume(tx_fir_convolve());
		}
		words[frame] = value << 8;

		tx_phase += CHIME_RESAMPLE_NUM;
		if (tx_phase >= TX_RESAMPLE_DEN) {
			tx_phase -= TX_RESAMPLE_DEN;
			tx_fir_push(chime_next_sample());
		}
	}
}

/* Same contract as convo_top_up_tx: fill the runway until the slab or the
 * driver queue is full; K_NO_WAIT everywhere. */
static int chime_top_up_tx(const struct device *i2s, uint32_t *tx_blocks)
{
	for (;;) {
		void *block;
		int error;

		if (k_mem_slab_alloc(&convo_tx_slab, &block, K_NO_WAIT) != 0) {
			return 0;
		}
		chime_fill_tx_block((int32_t *)block);
		error = i2s_write(i2s, block,
				  CONVO_TX_BLOCK_FRAMES * sizeof(int32_t));
		if (error != 0) {
			k_mem_slab_free(&convo_tx_slab, block);
			if (error == -EAGAIN || error == -ENOMSG) {
				return 0;
			}
			return error;
		}
		++*tx_blocks;
	}
}

/*
 * Play the chime while IDLE: full duplex bring-up exactly as
 * run_conversation does it (i2s_nrfx memcmps the two directions' configs,
 * and TX-only as a clock slave is an unproven path), mic RX read and
 * discarded to keep the BOTH transfer alive, then DROP + settle + clocks
 * off — the same teardown the conversation survives, so the next
 * conversation's bring-up starts from the identical driver state.
 *
 * Runs on the main thread's idle loop only; convo_active is a
 * belt-and-braces check, not a synchronization point.
 */
static int reflex_chime_play(const struct device *i2s, uint8_t chime_index)
{
	struct i2s_config config = {
		.word_size = 24U,
		.channels = 1U,
		.format = I2S_FMT_DATA_FORMAT_I2S,
		.options = I2S_OPT_BIT_CLK_TARGET | I2S_OPT_FRAME_CLK_TARGET,
		.frame_clk_freq = MIC_FRAME_RATE,
		.mem_slab = &mic_rx_slab,
		.block_size = MIC_RX_BLOCK_SIZE,
		.timeout = 1500,
	};
	struct i2s_config tx_config;
	uint32_t rx_blocks = 0U;
	uint32_t tx_blocks = 0U;
	bool i2s_running = false;
	int error;

	ARG_UNUSED(chime_index); /* one chime today; index reserved */

	if (atomic_get(&convo_active)) {
		return -EBUSY;
	}
	error = k_mem_slab_init(&mic_rx_slab, mic_rx_storage,
				MIC_RX_BLOCK_SIZE, MIC_RX_BLOCK_COUNT);
	if (error != 0) {
		return error;
	}
	tx_resample_reset();
	chime_synth_reset();
	mic_clocks_start();

	error = i2s_configure(i2s, I2S_DIR_RX, &config);
	if (error == 0) {
		tx_config = config;
		tx_config.mem_slab = &convo_tx_slab;
		tx_config.timeout = 0; /* never block the fill loop */
		error = i2s_configure(i2s, I2S_DIR_TX, &tx_config);
	}
	/* ESP32 resynchronizes after every BCLK restart; without the
	 * preamble the whole chime would be eaten by its sync hunt. */
	if (error == 0) {
		error = convo_queue_preamble(i2s);
	}
	if (error == 0) {
		error = chime_top_up_tx(i2s, &tx_blocks);
	}
	if (error == 0) {
		k_msleep(MIC_POWERUP_BUDGET_MS);
		printk("Chime: start (%u ms, %u source samples -> %u frames, "
		       "%u blocks)\n",
		       (unsigned int)(CHIME_SOURCE_SAMPLES / 16U),
		       (unsigned int)CHIME_SOURCE_SAMPLES,
		       (unsigned int)CHIME_OUT_FRAMES,
		       (unsigned int)CHIME_PLAY_BLOCKS);
		error = i2s_trigger(i2s, I2S_DIR_BOTH, I2S_TRIGGER_START);
	}
	if (error == 0) {
		i2s_running = true;
		while (rx_blocks < CHIME_PLAY_BLOCKS) {
			void *block;
			size_t size;

			error = i2s_read(i2s, &block, &size);
			if (error != 0) {
				printk("Chime I2S read failed: %d\n", error);
				break;
			}
			/* Mic audio is discarded — a chime has no uplink —
			 * but the read itself keeps the duplex transfer
			 * from dying of RX overrun. */
			k_mem_slab_free(&mic_rx_slab, block);
			++rx_blocks;
			error = chime_top_up_tx(i2s, &tx_blocks);
			if (error != 0) {
				printk("Chime I2S write failed: %d\n", error);
				break;
			}
		}
	}

	if (i2s_running) {
		/*
		 * DROP, never DRAIN — identical reasoning to the
		 * conversation teardown: draining as a clock slave wedges
		 * i2s_nrfx until power cycle.  Everything still queued here
		 * is silence by construction (the block budget already
		 * played the chime tail).
		 */
		(void)i2s_trigger(i2s, I2S_DIR_BOTH, I2S_TRIGGER_DROP);
		k_msleep(MIC_STOP_SETTLE_MS);
	}
	mic_clocks_stop();
	printk("Chime: done error=%d rx_blocks=%u tx_blocks=%u (I2S TX "
	       "frames left the wire; audible check is the ESP32/speaker's)\n",
	       error, rx_blocks, tx_blocks);
	return error;
}

