agenticaiuw/hivemind/firmware/nrf9160/src/main.c
/*
 * ---- Reflex action executors ----
 *
 * The interpreter (pendant_reflex.c) owns WHAT runs; these own HOW, since
 * the LED GPIO, the DRV2605L and the I2S chime all live in this file's
 * world.  All three run on the main thread's idle loop and may block for
 * the duration of their effect.
 */
static void reflex_do_led(uint8_t pattern)
{
	switch (pattern) {
	case REFLEX_LED_DOUBLE:
		flash_led(2U, 100, 100);
		break;
	case REFLEX_LED_TRIPLE:
		flash_led(3U, 100, 100);
		break;
	case REFLEX_LED_BURST:
		flash_led(6U, 40, 60);
		break;
	case REFLEX_LED_LONG:
		gpio_pin_set_dt(&led, 1);
		k_msleep(600);
		gpio_pin_set_dt(&led, 0);
		break;
	case REFLEX_LED_SINGLE:
	default:
		flash_led(1U, 120, 80);
		break;
	}
}

/* Nonzero when the motor is absent/failed — the interpreter then degrades
 * this step to the matching LED pattern (probe already logged once). */
static int reflex_do_haptic(uint8_t pattern)
{
	return haptic_play((enum haptic_pattern)pattern);
}

static int reflex_do_chime(uint8_t chime_index)
{
	return reflex_chime_play(DEVICE_DT_GET(I2S_NODE), chime_index);
}

static const struct pendant_reflex_ops reflex_ops_impl = {
	.led = reflex_do_led,
	.haptic = reflex_do_haptic,
	.chime = reflex_do_chime,
};

/*
 * WS I/O thread body. All socket work lives here so a stalled modem send
 * can never starve the audio loop's 20 ms TX deadline.
 *
 * Uplink: consume the SPSC wire FIFO, batch, send (blocking is fine on
 * this thread — SO_SNDTIMEO bounds it). Downlink: receive one message at a
 * time; binary frames go into dl_pipe as [2-byte BE frame length][bytes]
 * only when the pipe has room (backpressure = stop receiving, TCP holds
 * the rest); control frames become atomic flags. While no conversation is
 * active the thread just keeps the idle socket alive with pings.
 */
static void ws_io_pump_uplink(void)
{
	uint8_t staging[WS_TX_BATCH_BYTES];
	uint8_t *storage = live_fifo_storage();
	size_t fill;

	/* Gate shut: the packets stay in the FIFO and the radio stays
	 * silent. */
	if (!atomic_get(&convo_uplink_gate)) {
		return;
	}

	while ((fill = live_fifo_fill()) >= WS_TX_BATCH_BYTES ||
	       (live_tx_flush && fill > 0U)) {
		size_t tail = live_fifo_tail;
		size_t batch = MIN(fill, sizeof(staging));

		for (size_t i = 0U; i < batch; ++i) {
			staging[i] =
				storage[(tail + i) % OPUS_TX_FIFO_BYTES];
		}
		if (pendant_ws_send_binary(staging, batch) != 0) {
			atomic_set(&convo_end_req, 1);
			return;
		}
		live_fifo_tail = (tail + batch) % OPUS_TX_FIFO_BYTES;
	}
}

static void ws_io_drain_downlink(void)
{
	for (unsigned int budget = 0U; budget < 4U; ++budget) {
		bool is_text = false;
		int received;

		/* Backpressure: no free slot → stop reading the socket and
		 * let TCP flow control park the rest at the relay. */
		if (k_msgq_num_free_get(&dl_frames) == 0U) {
			return;
		}
		received = pendant_ws_recv(ws_rx_buf, sizeof(ws_rx_buf),
					   &is_text);
		if (received == 0) {
			return;
		}
		if (received < 0) {
			atomic_set(&convo_end_req, 1);
			return;
		}
		if (is_text) {
			ws_rx_buf[MIN((size_t)received,
				      sizeof(ws_rx_buf) - 1U)] = '\0';
			/*
			 * Recipe frames FIRST, on an EXACT "type":"recipe"
			 * match, and then NEVER through the legacy matching
			 * below: that matching is substring-based, so any
			 * recipe whose body happened to contain "end" (or
			 * "flush"/"started") would be misread as a control
			 * frame — "end" would kill the live conversation.
			 * The legacy started/flush/end behavior itself is
			 * deliberately unchanged.
			 */
			/*
			 * Context FIRST — ahead of even the recipe matcher.
			 * Every other frame can afford to be handled a tick
			 * later; this one decides what the owner's very next
			 * press means.
			 */
			if (menu_context_offer_frame((const char *)ws_rx_buf)) {
				continue;
			}
			if (pendant_reflex_offer_frame(
				    (const char *)ws_rx_buf)) {
				continue;
			}
			if (audio_sink_offer_frame((const char *)ws_rx_buf)) {
				continue;
			}
			/* Bluetooth device menu (bt_list / bt_select). Flags
			 * only — the UART write and the sink table live on
			 * main, never on this 2.5 KB socket stack. */
			if (pendant_bt_offer_frame((const char *)ws_rx_buf)) {
				continue;
			}
			/*
			 * The relay announces an approval readback about to
			 * play; the strong hit says "the next words want an
			 * answer" even in a loud room. The answer itself is
			 * now spoken, not pressed — the blue button became
			 * push-to-talk on 2026-08-12 — so this haptic is the
			 * whole device-side half of approvals, and it matters
			 * more, not less, for being the only cue.
			 * (Relay side of this frame is still TODO.)
			 */
			if (strstr((const char *)ws_rx_buf,
				   "\"approval_readback\"") != NULL) {
				/* One call, both channels: the amber fast
				 * blink and the double strong hit are the
				 * same transition, so the light can never
				 * say "nothing to answer" while the motor
				 * is saying the opposite. Safe from this
				 * 2.5 KB socket stack — it sets an atomic
				 * and reschedules work, nothing more. */
				pendant_status_set(PENDANT_STATUS_APPROVAL);
				continue;
			}
			if (strstr((const char *)ws_rx_buf,
				   "\"started\"") != NULL) {
				atomic_set(&convo_started, 1);
			} else if (strstr((const char *)ws_rx_buf,
					  "\"flush\"") != NULL) {
				if (atomic_get(&convo_started)) {
					atomic_set(&convo_flush_req, 1);
				}
			} else if (strstr((const char *)ws_rx_buf,
					  "\"end\"") != NULL) {
				if (atomic_get(&convo_started)) {
					atomic_set(&convo_end_req, 1);
				}
			}
			continue;
		}
		/* Reply audio from the previous conversation: discard. */
		if (!atomic_get(&convo_started)) {
			continue;
		}
		dl_tx_frame.length = (uint16_t)received;
		memcpy(dl_tx_frame.data, ws_rx_buf, (size_t)received);
		(void)k_msgq_put(&dl_frames, &dl_tx_frame, K_NO_WAIT);
	}
}

/*
 * Flush owner control frames (menu steps, menu select, knob position) onto
 * the converse socket. Runs ONLY on the WS I/O thread with ws_lock held,
 * both mid-conversation and idle, so a button never waits on the modem and
 * the socket is never touched from two threads.
 *
 * Drop-when-closed is the contract (see the atomics' declaration): a
 * closed socket clears the backlog instead of banking stale intent. A send
 * failure also just drops — if the transport actually died, the audio pump
 * or the idle reconnect discovers it within milliseconds; a lost menu
 * twist is not worth ending a conversation over.
 */
static void ws_io_send_owner_controls(void)
{
	if (!pendant_ws_connected()) {
		atomic_set(&menu_step_backlog, 0);
		atomic_set(&volume_report, -1);
		/* A ring cannot outlive its socket, so the verbs go global
		 * here rather than waiting for a teardown frame the dead
		 * socket cannot deliver. This also clears select/back. */
		menu_context_clear("socket closed");
		/* storage_notice_req is deliberately NOT cleared here — see
		 * its declaration. A closed socket is why it has not been
		 * delivered, not a reason to stop trying. */
		return;
	}

