agenticaiuw/hivemind/firmware/nrf9160/src/main.c
	/*
	 * First, ahead of the owner's own controls: this is a fact about what
	 * the device can no longer do, and the relay needs it before it
	 * answers anything the owner asks. Cleared only on a successful send.
	 */
	if (atomic_get(&storage_notice_req)) {
		if (pendant_ws_send_text(
			    "{\"type\":\"device_degraded\",\"subsystem\":\"storage\","
			    "\"lost\":[\"upload_journal\",\"outbox\",\"alert_inbox\"]}") ==
		    0) {
			atomic_set(&storage_notice_req, 0);
		}
	}

	/* One frame per detent, a few per pass: the relay's contract is
	 * delta:±1, and bounding the burst keeps this thread honest about
	 * its real job (audio) when the owner spins the knob. */
	for (unsigned int sent = 0U; sent < 4U; ++sent) {
		atomic_val_t backlog = atomic_get(&menu_step_backlog);

		if (backlog == 0) {
			break;
		}
		int step = backlog > 0 ? 1 : -1;

		if (pendant_ws_send_text(
			    step > 0 ? "{\"type\":\"menu\",\"delta\":1}"
				     : "{\"type\":\"menu\",\"delta\":-1}") !=
		    0) {
			break;
		}
		atomic_sub(&menu_step_backlog, step);
	}

	/*
	 * AFTER the detents above, always. The owner scrolls to an entry and
	 * then presses, so the scroll that chose it must already be on the
	 * wire: a select that overtook its own detent would commit the entry
	 * before the one the owner was actually standing on.
	 */
	/*
	 * Logged, unlike the detents beside them. A detent is one of forty in a
	 * spin and logging each would drown the console; a select or a back is
	 * a deliberate, rare act, and "did my press actually leave the device"
	 * is the exact question that cannot be answered from the outside — the
	 * relay ignores both frames when no conversation is live, so a press
	 * that never went out and a press that went out and was dropped look
	 * identical everywhere else.
	 */
	if (atomic_cas(&menu_select_req, 1, 0)) {
		printk("-> menu_select (%d)\n",
		       pendant_ws_send_text("{\"type\":\"menu_select\"}"));
	}
	if (atomic_cas(&menu_back_req, 1, 0)) {
		printk("-> menu_back (%d)\n",
		       pendant_ws_send_text("{\"type\":\"menu_back\"}"));
	}

	/* Knob position, latest state only (a twist mid-dead-zone already
	 * cleared above): same wire shape the ESP32's serial channel used,
	 * so the dashboard keys on nothing new. */
	atomic_val_t vol = atomic_set(&volume_report, -1);

	if (vol >= 0) {
		char frame[64];
		unsigned int hundredths = ((unsigned int)vol >> 16) & 0xFFFFU;

		snprintf(frame, sizeof(frame),
			 "{\"type\":\"volume\",\"level\":%u.%02u,\"raw\":%u}",
			 hundredths / 100U, hundredths % 100U,
			 (unsigned int)vol & 0xFFFFU);
		(void)pendant_ws_send_text(frame);
	}
}

static void ws_io_thread_fn(void *a, void *b, void *c)
{
	int64_t next_idle_ping = 0;

	ARG_UNUSED(a);
	ARG_UNUSED(b);
	ARG_UNUSED(c);

	for (;;) {
		if (atomic_get(&convo_active)) {
			k_mutex_lock(&ws_lock, K_FOREVER);
			if (pendant_ws_connected()) {
				ws_io_pump_uplink();
				ws_io_drain_downlink();
				ws_io_send_owner_controls();
			} else {
				atomic_set(&convo_end_req, 1);
			}
			k_mutex_unlock(&ws_lock);
			k_msleep(5);
			continue;
		}
		if (pendant_ws_connected()) {
			k_mutex_lock(&ws_lock, K_FOREVER);
			if (k_uptime_get() >= next_idle_ping) {
				(void)pendant_ws_ping();
				next_idle_ping = k_uptime_get() +
						 WS_IDLE_PING_SECONDS * 1000;
			}
			ws_io_send_owner_controls();
			/* Swallow pongs and the previous conversation's
			 * trailing frames every tick, not just at ping
			 * time, so none of it leads the next conversation.
			 * Recipe frames are the exception: the idle socket
			 * is exactly where the relay delivers them, so they
			 * are handed to the reflex layer instead of the
			 * bin (parse + SD + ack happen on main's idle
			 * loop, never on this 2.5 KB stack). */
			for (int drained = 1; drained > 0;) {
				bool is_text = false;

				drained = pendant_ws_recv(ws_rx_buf,
							  sizeof(ws_rx_buf),
							  &is_text);
				if (drained > 0 && is_text) {
					ws_rx_buf[MIN((size_t)drained,
						      sizeof(ws_rx_buf) -
							      1U)] = '\0';
					if (!menu_context_offer_frame(
						    (const char *)ws_rx_buf) &&
					    !pendant_reflex_offer_frame(
						    (const char *)ws_rx_buf) &&
					    /* Sink switches work idle
					     * too: the owner flips the
					     * default from the dashboard
					     * between conversations. */
					    !audio_sink_offer_frame(
						    (const char *)ws_rx_buf)) {
						/* Bluetooth menu: the relay
						 * asks for the device list and
						 * sends the owner's pick. Only
						 * flags are set here — the UART
						 * and the card belong to main. */
						(void)pendant_bt_offer_frame(
							(const char *)
								ws_rx_buf);
					}
				}
			}
			k_mutex_unlock(&ws_lock);
		} else {
			/* Drop-when-closed for the owner control frames: a
			 * twist banked across a dead link would replay as
			 * stale intent on reconnect. The context goes with
			 * them — no socket, no ring, global verbs. */
			atomic_set(&menu_step_backlog, 0);
			menu_context_clear("socket closed");
		}
		k_msleep(200);
	}
}

/*
 * Main-loop side of the downlink: pull whole frames from dl_pipe, decode
 * each packet into the jitter ring. Called between I2S blocks; bounded by
 * ring space, not time (a 60 ms decode is ~2-4 ms here).
 */
static void convo_decode_downlink(void)
{
	unsigned int decodes = 0U;

	while (decodes < CONVO_MAX_DECODES_PER_BLOCK) {
		size_t frame_bytes;
		size_t offset = 0U;

		if (DL_JITTER_SAMPLES - 1U - dl_jitter_fill() <
		    DL_WORST_FRAME_SAMPLES) {
			return;
		}
		if (k_msgq_get(&dl_frames, &dl_rx_frame, K_NO_WAIT) != 0) {
			return;
		}
		frame_bytes = dl_rx_frame.length;

		while (offset + 2U <= frame_bytes) {
			size_t packet_bytes =
				((size_t)dl_rx_frame.data[offset] << 8) |
				dl_rx_frame.data[offset + 1U];

			offset += 2U;
			if (packet_bytes == 0U ||
			    offset + packet_bytes > frame_bytes) {
				printk("Downlink framing broken (len=%u)\n",
				       (unsigned int)packet_bytes);
				atomic_set(&convo_end_req, 1);
				return;
			}
			uint32_t decode_started = k_cycle_get_32();
			int decoded = pendant_opus_reply_decode_packet(
				dl_rx_frame.data + offset, packet_bytes,
				dl_decode_buf, ARRAY_SIZE(dl_decode_buf));
			uint32_t decode_elapsed =
				k_cycle_get_32() - decode_started;

			convo_decode_cycles += decode_elapsed;
			++convo_decode_calls;
			if (decode_elapsed > convo_decode_max_cycles) {
				convo_decode_max_cycles = decode_elapsed;
			}

			if (decoded > 0) {
				dl_jitter_put(dl_decode_buf,
					      (size_t)decoded);
				++convo_decoded_packets;
			}
			offset += packet_bytes;
			++decodes;
		}
	}
}

