agenticaiuw/hivemind/firmware/nrf9160/src/main.c
/*
 * One press-to-press conversation: mic streams up, agent speech streams
 * down and PLAYS WHILE RECORDING — the model decides when to talk. Ends on
 * the second button press, relay 'end' (30 s of mutual silence), transport
 * death, or the runaway cap.
 */
/*
 * Tell the relay a conversation is starting and let the uplink flow. This
 * function contains the first byte this device transmits for a press.
 */
static int convo_open_uplink(char *device_time, size_t device_time_capacity)
{
	char start_message[96];
	int error;

	k_mutex_lock(&ws_lock, K_FOREVER);
	error = pendant_ws_connect();
	if (error == 0) {
		pendant_cloud_copy_device_time(device_time,
					       device_time_capacity);
		snprintf(start_message, sizeof(start_message),
			 "{\"type\":\"start\",\"deviceTime\":\"%s\"}",
			 device_time);
		error = pendant_ws_send_text(start_message);
	}
	k_mutex_unlock(&ws_lock);
	if (error == 0) {
		/* Release the held packets. The WS thread flushes them on its
		 * next pass, oldest first, so the relay hears the utterance
		 * from its true beginning. */
		atomic_set(&convo_uplink_gate, 1);
	}
	return error;
}

static int run_conversation(const struct device *i2s)
{
	struct i2s_config config = {
		.word_size = 24U,
		.channels = 1U,
		.format = I2S_FMT_DATA_FORMAT_I2S,
		.options = I2S_OPT_BIT_CLK_TARGET | I2S_OPT_FRAME_CLK_TARGET,
		.frame_clk_freq = MIC_FRAME_RATE,
		.mem_slab = &mic_rx_slab,
		.block_size = MIC_RX_BLOCK_SIZE,
		.timeout = 1500,
	};
	struct i2s_config tx_config;
	int32_t raw_processing[MIC_RX_BLOCK_FRAMES];
	char device_time[32];
	/* Has this press been allowed to transmit yet? */
	bool uplink_open = false;
	int64_t started_at;
	int64_t next_led_toggle;
	size_t stage_frames = 0U;
	size_t block_index = 0U;
	int32_t hpf_prev_in = 0;
	int32_t hpf_prev_out = 0;
	bool hpf_primed = false;
	int32_t slew_prev = 0;
	bool slew_primed = false;
	bool i2s_running = false;
	bool stop_sent = false;
	int result = 0;
	int error;

	live_stream_failed = false;
	live_tx_saturated = false;
	live_fifo_reset();
	dl_jitter_reset();
	tx_resample_reset();
	k_msgq_purge(&dl_frames);
	atomic_set(&convo_flush_req, 0);
	atomic_set(&convo_end_req, 0);
	atomic_set(&convo_started, 0);
	convo_tx_blocks = 0U;
	convo_tx_starved = 0U;
	convo_tx_dry = false;
	convo_rx_blocks = 0U;
	convo_decoded_packets = 0U;
	convo_max_loop_ms = 0U;
	convo_uplink_drops = 0U;
	convo_mic_drops = 0U;
	convo_tx_peak = 0U;
#ifdef CONFIG_PENDANT_MIC_INJECT
	/* Per-conversation, like every other counter here. Head/tail are
	 * deliberately untouched: the host prefills the ring before pressing,
	 * and resetting the indices here would throw that prefill away. */
	pendant_inject_frames = 0U;
	pendant_inject_underruns = 0U;
#endif
	convo_uplink_ducked = false;
	convo_uplink_holding = false;
	convo_dl_active_until = 0;
	convo_adapt_last_ms = 0;
	convo_uplink_duck_ms = 0U;
	convo_uplink_held = 0U;
	convo_decode_cycles = 0U;
	convo_decode_calls = 0U;
	convo_decode_max_cycles = 0U;
	convo_encode_cycles = 0U;
	convo_encode_calls = 0U;
	convo_encode_max_cycles = 0U;

	atomic_set(&convo_uplink_gate, 1);
	error = convo_open_uplink(device_time, sizeof(device_time));
	if (error != 0) {
		return error;
	}
	uplink_open = true;

	error = pendant_opus_stream_begin_packets(SAMPLE_RATE,
						  audio_workspace,
						  OPUS_TX_ARENA_BYTES,
						  live_opus_packet_sink);
	if (error != 0) {
		printk("Conversation encoder init failed: %d\n", error);
		return error;
	}
	error = pendant_opus_reply_decoder_begin_rate(
		opus_dec_arena, sizeof(opus_dec_arena),
		PENDANT_OPUS_REPLY_SAMPLE_RATE);
	if (error < 0) {
		printk("Conversation decoder init failed: %d\n", error);
		pendant_opus_stream_abort();
		return error;
	}

	error = k_mem_slab_init(&mic_rx_slab, mic_rx_storage,
				MIC_RX_BLOCK_SIZE, MIC_RX_BLOCK_COUNT);
	if (error != 0) {
		goto teardown;
	}

	/* Duplex capture is a recording like any other — the microphone is
	 * open and the owner is talking, so it wears the same red. */
	pendant_status_set(PENDANT_STATUS_RECORDING);
	gpio_pin_set_dt(&led, 1);
	next_led_toggle = k_uptime_get() + 250;
	mic_clocks_start();

	error = i2s_configure(i2s, I2S_DIR_RX, &config);
	if (error != 0) {
		goto teardown_clocks;
	}
	tx_config = config;
	tx_config.mem_slab = &convo_tx_slab;
	/*
	 * TX writes must NEVER block. i2s_write waits up to cfg.timeout for
	 * a free tx_queue slot, which paces the loop to exactly one RX block
	 * per block period — leaving no way to drain an RX backlog after a
	 * stall, so the backlog grows until the RX queue overflows and the
	 * driver errors the transfer (observed as -EIO at ~15 s). With 0 the
	 * top-up simply stops when the runway is full and the loop is free
	 * to catch up. RX keeps its own timeout for i2s_read.
	 */
	tx_config.timeout = 0;
	error = i2s_configure(i2s, I2S_DIR_TX, &tx_config);
	if (error != 0) {
		goto teardown_clocks;
	}

	/* START in BOTH mode needs TX blocks queued first. */
	error = convo_queue_preamble(i2s);
	if (error != 0) {
		goto teardown_clocks;
	}

	k_msleep(MIC_POWERUP_BUDGET_MS);
	printk("Conversation: duplex I2S bclk_hz=%u lrclk_hz=%u "
	       "(mic %u Hz up, agent 24 kHz down)\n",
	       16000000U / MIC_BCLK_TOP, 16000000U / MIC_LRCLK_TOP,
	       SAMPLE_RATE);
	error = i2s_trigger(i2s, I2S_DIR_BOTH, I2S_TRIGGER_START);
	if (error != 0) {
		goto teardown_clocks;
	}
	i2s_running = true;
	started_at = k_uptime_get();
	clear_button_events();
	k_msgq_purge(&mic_raw_q);
	atomic_set(&audio_thread_error, 0);
	/* Hand the I2S deadlines to the audio thread from here on. */
	audio_i2s_dev = i2s;
	atomic_set(&convo_active, 1);

	while (true) {
		void *block;
		int64_t loop_started;

		/*
		 * Codec-side loop. The audio thread owns every I2S deadline;
		 * this one may take as long as an Opus frame needs without
		 * endangering the transfer. A missed block here costs mic
		 * audio (counted as mic_drops), never the conversation.
		 */
		if (k_msgq_get(&mic_raw_q, &block, K_MSEC(200)) != 0) {
			if (atomic_get(&convo_end_req) ||
			    !atomic_get(&convo_active)) {
				break;
			}
			continue;
		}
		loop_started = k_uptime_get();
		memcpy(raw_processing, block, MIC_RX_BLOCK_SIZE);
		k_mem_slab_free(&mic_rx_slab, block);

