agenticaiuw/hivemind/firmware/nrf9160/src/main.c
		size_t size = MIC_RX_BLOCK_SIZE;

		if (block_index < MIC_STARTUP_SKIP_BLOCKS) {
			++block_index;
			clear_button_events();
			continue;
		}
		++block_index;

		/* Decide duck/hold for THIS block before any of it is encoded. */
		convo_update_uplink_adapt();

		/* Mic DSP — the twin of record_microphone's inner loop
		 * (slew limit → decimate-average → DC blocker → gain). */
		int32_t *raw = raw_processing;
		size_t out_frames = (size / sizeof(int32_t)) / MIC_DECIMATION;

		for (size_t frame = 0U; frame < out_frames; ++frame) {
			int32_t first = raw[frame * MIC_DECIMATION] >>
					MIC_SAMPLE_SHIFT;
			int32_t second = raw[frame * MIC_DECIMATION + 1U] >>
					 MIC_SAMPLE_SHIFT;

			if (!slew_primed) {
				slew_prev = first;
				slew_primed = true;
			}
			int32_t delta = first - slew_prev;

			delta = CLAMP(delta, -MIC_SLEW_LIMIT, MIC_SLEW_LIMIT);
			slew_prev += delta;
			first = slew_prev;
			delta = second - slew_prev;
			delta = CLAMP(delta, -MIC_SLEW_LIMIT, MIC_SLEW_LIMIT);
			slew_prev += delta;
			second = slew_prev;

			int32_t sample = ((first + second) / 2) >> 8;

			if (!hpf_primed) {
				hpf_prev_in = sample;
				hpf_primed = true;
			}
			int32_t filtered =
				sample - hpf_prev_in +
				(int32_t)(((int64_t)MIC_HPF_COEFF_Q15 *
					   hpf_prev_out) >>
					  15);
			hpf_prev_in = sample;
			hpf_prev_out = filtered;

			int32_t amplified = filtered * MIC_GAIN;

			amplified = CLAMP(amplified, INT16_MIN, INT16_MAX);
			mic_stage_samples[stage_frames] = (int16_t)amplified;
			if (++stage_frames == MIC_STAGE_FRAMES) {
				/* Harness builds only, and only while armed:
				 * swap the mic's stage for injected PCM before
				 * the encoder ever sees it. */
				(void)pendant_inject_fill_stage(
					mic_stage_samples, MIC_STAGE_FRAMES);
				live_tx_offer_stage(mic_stage_samples,
						    MIC_STAGE_FRAMES);
				stage_frames = 0U;
			}
		}
		if (live_stream_failed) {
			result = -EIO;
			break;
		}

		/* The WS thread moves bytes; this loop only decodes. The
		 * audio thread owns playback state and barge-in flushes. */
		convo_decode_downlink();

		/*
		 * Blue button, mid-conversation: push-to-talk does not nest
		 * inside a call. Consume the press and tick, so it cannot fire
		 * a surprise capture the moment this conversation ends.
		 */
		blue_press_in_conversation();

		if (atomic_get(&convo_end_req)) {
			/* Relay 'end' (mutual silence) or transport close —
			 * a normal conversation ending, not a failure. */
			printk("Conversation ended by relay/transport\n");
			error = 0;
			break;
		}

		/* Solid LED while agent audio is buffered, blink otherwise. */
		if (dl_jitter_fill() > 0U) {
			gpio_pin_set_dt(&led, 1);
			next_led_toggle = k_uptime_get() + 250;
		} else if (k_uptime_get() >= next_led_toggle) {
			gpio_pin_toggle_dt(&led);
			next_led_toggle = k_uptime_get() + 250;
		}

		/* Knob at full rate exactly when it matters — while agent
		 * audio is playing. Internally gated to 50 ms; the one-shot
		 * SAADC read is microseconds against the TX runway. */
		volume_poll();
		/*
		 * The bench keeps watching mid-conversation. A diagnostic that
		 * goes blind during its own audio window is the failure this
		 * replaces: the owner presses a button BECAUSE audio is
		 * playing, so that is precisely when the dashboard must not
		 * stop reporting. Rate-limited inside (150 ms floor,
		 * change-driven), so a quiet call here is a few register reads.
		 */
		pendant_bench_tick();

		if (k_uptime_get() - started_at >
		    (int64_t)CONVO_MAX_SECONDS * 1000) {
			printk("Conversation hit the %u s cap\n",
			       CONVO_MAX_SECONDS);
			break;
		}
#if PENDANT_BOOT_CONVERSATION_TEST
		if (k_uptime_get() - started_at >
		    (int64_t)PENDANT_BOOT_CONVERSATION_SECONDS * 1000) {
			printk("Self-test conversation window elapsed\n");
			break;
		}
#endif
		/* Bounce/release edges from the starting press for the first
		 * second; after that yellow acts. */
		if (k_uptime_get() - started_at < 1000) {
			clear_button_events();
		} else if (k_sem_take(&button_press_sem, K_NO_WAIT) == 0 ||
			   take_remote_press()) {
			/*
			 * WITH A RING OPEN, YELLOW SELECTS — IT MUST NOT HANG
			 * UP. The ring lives inside this very conversation, so
			 * the press that commits an entry and the press that
			 * ends the call are the same physical button separated
			 * only by context. Getting this backwards would drop
			 * the owner's call every time they tried to choose
			 * something, which on a screenless device looks exactly
			 * like a crash.
			 */
			if (menu_context_is_active()) {
				atomic_set(&menu_select_req, 1);
				haptic_trigger(HAPTIC_PATTERN_TICK);
			} else {
				haptic_trigger(HAPTIC_PATTERN_CLICK);
				printk("Conversation ended by button\n");
				break;
			}
		}

		/* Loop time is the whole ballgame: exceed the TX runway and
		 * the driver kills the duplex transfer. Track the worst. */
		uint32_t loop_ms = (uint32_t)(k_uptime_get() - loop_started);

		if (loop_ms > convo_max_loop_ms) {
			convo_max_loop_ms = loop_ms;
		}
	}

	/* Stop the audio thread before touching I2S or the slabs. */
	atomic_set(&convo_active, 0);
	/* Never leave the legacy record path gated by a conversation's hold. */
	convo_uplink_holding = false;
#ifdef CONFIG_PENDANT_MIC_INJECT
	/*
	 * Injection is scoped to one conversation, and disarming here is the
	 * safety net for a host that died mid-run. An armed ring nobody is
	 * feeding does not fail loudly — it silently replaces the microphone
	 * with silence, so the owner's next press would record nothing and
	 * look like broken hardware. Bounding that to the conversation it was
	 * armed for keeps a debug tool from becoming a latent product fault.
	 */
	pendant_inject_arm = 0U;
#endif
	k_msleep(30);
	if (result == 0 && atomic_get(&audio_thread_error) != 0) {
		result = (int)atomic_get(&audio_thread_error);
	}
	{
		void *stale;

		while (k_msgq_get(&mic_raw_q, &stale, K_NO_WAIT) == 0) {
			k_mem_slab_free(&mic_rx_slab, stale);
		}
	}

	printk("Conversation stats: rx_blocks=%u tx_blocks=%u tx_starved=%u "
	       "decoded_packets=%u max_loop_ms=%u fifo_left=%u "
	       "uplink_drops=%u mic_drops=%u tx_peak=%u "
	       "duck_ms=%u uplink_held=%u" PENDANT_INJECT_STATS_FMT
	       PENDANT_STORE_STATS_FMT "\n",
	       convo_rx_blocks, convo_tx_blocks, convo_tx_starved,
	       convo_decoded_packets, convo_max_loop_ms,
	       (uint32_t)live_fifo_fill(), convo_uplink_drops,
	       convo_mic_drops, convo_tx_peak, convo_uplink_duck_ms,
	       convo_uplink_held PENDANT_INJECT_STATS_ARGS
		       PENDANT_STORE_STATS_ARGS);
	printk("Codec cost: decode avg=%u us max=%u us n=%u | "
	       "encode avg=%u us max=%u us n=%u\n",
	       convo_decode_calls
		       ? cycles_to_us(convo_decode_cycles / convo_decode_calls)
		       : 0U,
	       cycles_to_us(convo_decode_max_cycles), convo_decode_calls,
	       convo_encode_calls
		       ? cycles_to_us(convo_encode_cycles / convo_encode_calls)
		       : 0U,
	       cycles_to_us(convo_encode_max_cycles), convo_encode_calls);

teardown_clocks:
	if (i2s_running) {
		/*
		 * DROP, never DRAIN: as a clock-slave, draining needs the PWM
		 * clocks to keep running until every queued TX block plays
		 * out — a 12 ms settle is not enough, and killing the clocks
		 * mid-STOPPING wedges i2s_nrfx (configure then fails -EINVAL
		 * until reboot; review finding). DROP forces READY
		 * synchronously and frees the queued blocks; the ≤41 ms of
		 * tail audio it discards is silence or flushed speech.
		 */
		(void)i2s_trigger(i2s, I2S_DIR_BOTH, I2S_TRIGGER_DROP);
		k_msleep(MIC_STOP_SETTLE_MS);
	}
	mic_clocks_stop();
	gpio_pin_set_dt(&led, 0);
teardown:
	atomic_set(&convo_active, 0);
	/* Whatever happens next, the gate belongs to the NEXT press. */
	atomic_set(&convo_uplink_gate, 0);
	k_mutex_lock(&ws_lock, K_FOREVER);
	/*
	 * Only a conversation the relay was told about needs telling it is
	 * over. A press answered on-device was never announced, so a "stop"
	 * here would be this device's only transmission for that press —
	 * spending the radio to report that it did not need the radio.
	 */
	if (uplink_open && pendant_ws_connected() && !stop_sent) {
		(void)pendant_ws_send_text("{\"type\":\"stop\"}");
		stop_sent = true;
	}
	k_mutex_unlock(&ws_lock);
	pendant_opus_stream_abort();
	pendant_opus_reply_decoder_end();
	clear_button_events();
	/* A green or blue press mid-conversation was not a capture request —
	 * it was a mispress during a call. Consuming both here keeps them from
	 * firing a surprise capture the moment the call ends. */
	clear_green_events();
	clear_blue_events();
	if (result == 0 && error != 0) {
		result = error;
	}
	return result;
}

