agenticaiuw/hivemind/firmware/nrf9160/src/main.c
/*
 * Green button: record-only memo. The same proven capture machinery as a
 * voice command — record_microphone with the live chunked uplink and the
 * SD journal fallback — with pendant_cloud's memo latch held for the whole
 * cycle, so every request this press can possibly make (live stream, SD
 * single-shot, offline hold) reaches the relay as ?dispatch=0: transcribed
 * and stored, planner never woken. Runs regardless of whether the converse
 * WebSocket is up; a memo never wants the duplex path because a memo wants
 * no reply.
 */
static int run_memo_capture(const struct device *i2s)
{
	int64_t memo_started = k_uptime_get();
	uint32_t pcm_bytes;
	int error;

	pendant_cloud_stream_set_memo(true);
	memo_capture_active = true;
	error = record_microphone(i2s, MAX_RECORD_SAMPLE_COUNT);
	memo_capture_active = false;
	/* Mic closed, upload in flight: leaving RECORDING fires the exit tick
	 * and the amber breath says the work is not finished yet. */
	pendant_status_set(PENDANT_STATUS_THINKING);
	gpio_pin_set_dt(&led, 0);
	if (error != 0) {
		printk("Memo recording failed: %d\n", error);
		pendant_cloud_stream_abort();
		recording_on_sd = false;
		pendant_cloud_stream_set_memo(false);
		pendant_status_set(PENDANT_STATUS_IDLE);
		pendant_status_set(PENDANT_STATUS_FAILED);
		flash_led(3U, 120, 120);
		return error;
	}

	pcm_bytes = recorded_samples * (uint32_t)sizeof(int16_t);

	bool live_ok = pendant_cloud_stream_active() && !live_stream_failed &&
		       pendant_cloud_stream_bytes_sent() > 0U;

	error = -EIO;
	if (live_ok) {
		error = pendant_cloud_stream_end();
		printk("LAT memo_stream_end_ms=%lld pcm_bytes=%u result=%d\n",
		       k_uptime_get() - memo_started,
		       pendant_cloud_uploaded_pcm_bytes, error);
	} else if (pendant_cloud_stream_active()) {
		pendant_cloud_stream_abort();
	}

	if (error < 0 && recording_on_sd && pcm_bytes > 0U) {
		printk("Memo fallback SD upload (%u bytes, live_result=%d)\n",
		       pcm_bytes, error);
		error = pendant_cloud_upload_recording(SD_RECORDING_PATH,
						       pcm_bytes, SAMPLE_RATE);
		if (error < 0) {
			/* Same rename-into-the-outbox rescue as a failed
			 * command, under the memo kind so redelivery keeps
			 * the planner off (see pendant_store.h). */
			int queue_error = pendant_store_enqueue_memo(pcm_bytes);

			if (queue_error == 0) {
				printk("Memo held for later delivery "
				       "(upload=%d)\n",
				       error);
				pendant_cloud_stream_set_memo(false);
				/* Held, not lost: the memo is safe on the
				 * card, so this is a success the owner can
				 * walk away from. */
				pendant_status_set(PENDANT_STATUS_IDLE);
				pendant_status_set(PENDANT_STATUS_DONE);
				flash_led(2U, 60, 90);
				return 0;
			}
			printk("Could not hold memo: %d\n", queue_error);
		}
	}
	pendant_cloud_stream_set_memo(false);

	printk("LAT memo_total_ms=%lld result=%d\n",
	       k_uptime_get() - memo_started, error);
	pendant_status_set(PENDANT_STATUS_IDLE);
	if (error < 0) {
		pendant_status_set(PENDANT_STATUS_FAILED);
		flash_led(5U, 100, 100);
		return error;
	}
	/* Two calm flashes: memo landed, nothing is going to talk back. */
	pendant_status_set(PENDANT_STATUS_DONE);
	flash_led(2U, 60, 90);
	return 0;
}

/*
 * ---- Blue button: PUSH-TO-TALK ----
 *
 * WHY THIS IS THE CHEAPEST WAY TO ASK A QUESTION (owner's ruling, and the
 * arithmetic behind it — hardware/design/Solar_Feasibility.md §4.3):
 *
 *   A PTT question (10 s ask + 15 s reply) costs 0.94 mWh. The SAME
 *   question asked as a short duplex exchange costs 2.3 mWh. 2.4x, and the
 *   reason is not the codec or the speaker — it is WHEN the radio is on.
 *   Capturing with the modem out of connected mode draws 4.2 mA; the
 *   modem's connected floor is ~65 mA (45 mA RX monitor before any TX,
 *   x1.2 wrist antenna penalty). Duplex pays that floor for every second
 *   the human is talking and thinking. Push-to-talk pays 4.2 mA for those
 *   seconds and touches the radio exactly once.
 *
 *   That once is not free either: every radio touch pays a ~0.32 mWh RRC
 *   connection tax (setup + the C-DRX release tail). Which is precisely why
 *   this is ONE connection — capture with the radio off, then a single
 *   chunked upload that carries the question up and the spoken answer back
 *   down the same socket, then idle. Splitting it into "upload now, fetch
 *   the reply later" would double the tax and wipe out most of the win.
 *
 * The mechanism invents no transport. It is the proven non-duplex HTTP
 * command shape: /v1/pendant/command with dispatch ON (this is a question —
 * the planner is the point, unlike the green button's ?dispatch=0) and
 * X-Reply-Stream: opus, so the relay streams the reply as length-prefixed
 * Opus packets on the upload socket. Playback is the conversation's own
 * downlink path — same decoder, same 24 kHz jitter ring, same 96/125 TX
 * resampler, same sync preamble — so whatever the current sink is (the
 * ESP32/Bluetooth or the MAX98357A speaker, per audio_sink) hears it with
 * no new audio code at all.
 */
/* 45 s of reply at 20.48 ms per I2S block. A "short spoken answer" that
 * outruns this is a bug upstream, and a runaway must not hold the mic. */
#define PTT_REPLY_MAX_BLOCKS 2200U
/* Blocks to keep playing after the stream ends: the TX runway (10) plus the
 * FIR tail, so the last syllable leaves the wire before DROP discards it. */
#define PTT_REPLY_TAIL_BLOCKS 14U

/*
 * Pull whatever the reply socket has ready and decode it into the jitter
 * ring. Non-blocking by contract, and bounded exactly like the conversation
 * downlink (CONVO_MAX_DECODES_PER_BLOCK) so one call can never overrun the
 * I2S block it is riding between.
 *
 * dl_rx_frame is the reassembly buffer. It is the WS conversation's
 * main-thread frame slot, idle by construction here (no conversation can be
 * open during a PTT reply), so a 640 B staging area costs zero new RAM.
 */
static bool ptt_reply_pump(size_t *fill, bool *eof)
{
	unsigned int decodes = 0U;
	size_t offset = 0U;
	bool starved = false;
	int received;

	if (!*eof && *fill < sizeof(dl_rx_frame.data)) {
		received = pendant_cloud_reply_read(dl_rx_frame.data + *fill,
						    sizeof(dl_rx_frame.data) -
							    *fill);
		if (received > 0) {
			*fill += (size_t)received;
		} else if (received == 0) {
			*eof = true; /* clean end of the reply body */
		} else if (received != -EAGAIN) {
			printk("PTT reply read failed: %d\n", received);
			*eof = true;
		}
	}

	while (offset + 2U <= *fill && decodes < CONVO_MAX_DECODES_PER_BLOCK) {
		size_t packet_bytes = ((size_t)dl_rx_frame.data[offset] << 8) |
				      dl_rx_frame.data[offset + 1U];

		if (packet_bytes == 0U ||
		    packet_bytes > sizeof(dl_rx_frame.data) - 2U) {
			printk("PTT reply framing broken (len=%u)\n",
			       (unsigned int)packet_bytes);
			*eof = true;
			*fill = 0U;
			return true;
		}
		if (offset + 2U + packet_bytes > *fill) {
			break; /* packet still arriving */
		}
		/* Receive gate: never decode into a ring that cannot hold the
		 * result — the same rule the conversation downlink follows. */
		if (DL_JITTER_SAMPLES - 1U - dl_jitter_fill() <
		    DL_WORST_FRAME_SAMPLES) {
			starved = true;
			break;
		}
		int decoded = pendant_opus_reply_decode_packet(
			dl_rx_frame.data + offset + 2U, packet_bytes,
			dl_decode_buf, ARRAY_SIZE(dl_decode_buf));

		if (decoded > 0) {
			dl_jitter_put(dl_decode_buf, (size_t)decoded);
		}
		offset += 2U + packet_bytes;
		++decodes;
	}

	if (offset > 0U) {
		*fill -= offset;
		memmove(dl_rx_frame.data, dl_rx_frame.data + offset, *fill);
	}
	/*
	 * "Done" means the socket is finished AND nothing decodable is left.
	 * The loop exits for three reasons and only one of them means empty:
	 * it hit the per-block decode cap (more to come), the jitter ring was
	 * full (more to come), or it ran out of bytes — which after EOF is the
	 * end, including the case where the tail is an incomplete packet the
	 * relay will never finish. Deciding on the socket alone would cut the
	 * last packets; deciding on the buffer alone would spin on that
	 * trailing fragment until the runaway cap, holding the microphone.
	 */
	return *eof && !starved && decodes < CONVO_MAX_DECODES_PER_BLOCK;
}

