agenticaiuw/hivemind/firmware/nrf9160/src/main.c
/*
 * Play the inline reply through the current sink. Duplex I2S bring-up and
 * teardown are copied from reflex_chime_play for the reason stated there:
 * i2s_nrfx memcmps the two directions' configs and TX-only as a clock slave
 * is an unproven path, so the mic runs and its blocks are discarded. The
 * discarded RX read is also what paces this loop at one block per 20.48 ms.
 */
static int ptt_reply_play(const struct device *i2s)
{
	struct i2s_config config = {
		.word_size = 24U,
		.channels = 1U,
		.format = I2S_FMT_DATA_FORMAT_I2S,
		.options = I2S_OPT_BIT_CLK_TARGET | I2S_OPT_FRAME_CLK_TARGET,
		.frame_clk_freq = MIC_FRAME_RATE,
		.mem_slab = &mic_rx_slab,
		.block_size = MIC_RX_BLOCK_SIZE,
		.timeout = 1500,
	};
	struct i2s_config tx_config;
	size_t fill = 0U;
	uint32_t blocks = 0U;
	uint32_t tail_blocks = 0U;
	bool playing = false;
	bool source_eof = false;
	bool source_done = false;
	bool i2s_running = false;
	int error;

	error = k_mem_slab_init(&mic_rx_slab, mic_rx_storage,
				MIC_RX_BLOCK_SIZE, MIC_RX_BLOCK_COUNT);
	if (error != 0) {
		return error;
	}
	dl_jitter_reset();
	tx_resample_reset();
	convo_tx_peak = 0U;

	/* The encoder is finished with the workspace; the decoder has its own
	 * arena, so the two never contend here the way they do in a call. */
	error = pendant_opus_reply_decoder_begin_rate(
		opus_dec_arena, sizeof(opus_dec_arena),
		PENDANT_OPUS_REPLY_SAMPLE_RATE);
	if (error < 0) {
		printk("PTT reply decoder init failed: %d\n", error);
		return error;
	}
	(void)pendant_cloud_reply_set_nonblocking(true);

	mic_clocks_start();
	error = i2s_configure(i2s, I2S_DIR_RX, &config);
	if (error == 0) {
		tx_config = config;
		tx_config.mem_slab = &convo_tx_slab;
		tx_config.timeout = 0; /* never block the fill loop */
		error = i2s_configure(i2s, I2S_DIR_TX, &tx_config);
	}
	/* The ESP32 re-hunts sync after every BCLK restart; without this the
	 * front of the answer is eaten by its lock search. */
	if (error == 0) {
		error = convo_queue_preamble(i2s);
	}
	if (error == 0) {
		k_msleep(MIC_POWERUP_BUDGET_MS);
		error = i2s_trigger(i2s, I2S_DIR_BOTH, I2S_TRIGGER_START);
	}
	if (error == 0) {
		i2s_running = true;
		gpio_pin_set_dt(&led, 1);
		while (blocks < PTT_REPLY_MAX_BLOCKS) {
			void *block;
			size_t size;

			if (i2s_read(i2s, &block, &size) != 0) {
				printk("PTT reply I2S read failed\n");
				break;
			}
			k_mem_slab_free(&mic_rx_slab, block);
			++blocks;

			if (!source_done) {
				source_done = ptt_reply_pump(&fill,
							     &source_eof);
			}
			error = convo_top_up_tx(i2s, &playing);
			if (error != 0) {
				printk("PTT reply I2S write failed: %d\n",
				       error);
				break;
			}
			if (source_done && dl_jitter_fill() == 0U) {
				if (++tail_blocks >= PTT_REPLY_TAIL_BLOCKS) {
					break;
				}
			} else {
				tail_blocks = 0U;
			}
		}
	}

	if (i2s_running) {
		/* DROP, never DRAIN — draining as a clock slave wedges
		 * i2s_nrfx until a power cycle (same rule as every other
		 * teardown in this file). */
		(void)i2s_trigger(i2s, I2S_DIR_BOTH, I2S_TRIGGER_DROP);
		k_msleep(MIC_STOP_SETTLE_MS);
	}
	mic_clocks_stop();
	gpio_pin_set_dt(&led, 0);
	pendant_opus_reply_decoder_end();
	printk("PTT reply played: blocks=%u peak=%u sink=%s error=%d\n", blocks,
	       convo_tx_peak, audio_sink_name(audio_sink_current), error);
	return error;
}

/*
 * Blue button, whole cycle: capture radio-off, upload once with the planner
 * on, play the answer, radio back to idle.
 *
 * The upload reuses the live encoder + FIFO + chunked-POST machinery a
 * yellow press uses, only fed from the microSD journal instead of the
 * microphone: the FIFO holds ~7 KB (a few seconds of Opus) while a 30 s
 * question is ~60 KB, so feed and pump have to interleave exactly as they
 * do during a live capture. That is the same code path, not a parallel one.
 */
static int run_ptt_question(const struct device *i2s)
{
	int64_t ptt_started = k_uptime_get();
	struct fs_file_t journal;
	uint32_t pcm_bytes;
	bool journal_open = false;
	int error;

	/* dispatch ON: a question wants the planner. The memo latch is the
	 * only thing that could turn it off, so state it rather than assume
	 * the last press left it clean. */
	pendant_cloud_stream_set_memo(false);
	capture_radio_off = true;
	ptt_capture_active = true;
	error = record_microphone(i2s, MAX_RECORD_SAMPLE_COUNT);
	ptt_capture_active = false;
	capture_radio_off = false;
	/* Question captured; the radio, the upload and the answer are all
	 * still ahead. Amber until the reply plays. */
	pendant_status_set(PENDANT_STATUS_THINKING);
	gpio_pin_set_dt(&led, 0);
	if (error != 0) {
		printk("PTT capture failed: %d\n", error);
		recording_on_sd = false;
		pendant_status_set(PENDANT_STATUS_IDLE);
		pendant_status_set(PENDANT_STATUS_FAILED);
		flash_led(3U, 120, 120);
		return error;
	}

	pcm_bytes = recorded_samples * (uint32_t)sizeof(int16_t);
	if (pcm_bytes == 0U || !recording_on_sd) {
		printk("PTT capture produced nothing to ask (%u B, sd=%d)\n",
		       pcm_bytes, recording_on_sd ? 1 : 0);
		pendant_status_set(PENDANT_STATUS_IDLE);
		pendant_status_set(PENDANT_STATUS_FAILED);
		flash_led(3U, 120, 120);
		return -ENODATA;
	}
	printk("LAT ptt_capture_ms=%lld pcm_bytes=%u\n",
	       k_uptime_get() - ptt_started, pcm_bytes);

	/* THE radio touch. One socket, one RRC connection, question up and
	 * answer down. */
	error = pendant_cloud_stream_ensure(PENDANT_OPUS_SAMPLE_RATE);
	if (error == 0) {
		live_stream_failed = false;
		live_tx_saturated = false;
		live_fifo_reset();
		error = pendant_opus_stream_begin_packets(
			SAMPLE_RATE, audio_workspace, OPUS_TX_ARENA_BYTES,
			live_opus_packet_sink);
		if (error != 0) {
			printk("PTT encoder init failed: %d\n", error);
			pendant_cloud_stream_abort();
		}
	}
	if (error == 0) {
		fs_file_t_init(&journal);
		error = fs_open(&journal, SD_RECORDING_PATH, FS_O_READ);
		journal_open = error == 0;
	}
	while (error == 0 && journal_open) {
		/* mic_stage_samples is the capture staging buffer, free the
		 * moment the mic stops — reused here so the read costs no RAM. */
		ssize_t got = fs_read(&journal, mic_stage_samples,
				      MIC_STAGE_BYTES);

		if (got < 0) {
			error = (int)got;
			break;
		}
		if (got == 0) {
			break;
		}
		size_t frames = (size_t)got / sizeof(int16_t);

		/* Pad a short final read: the encoder's stage contract is a
		 * whole MIC_STAGE_FRAMES block. */
		while (frames < MIC_STAGE_FRAMES) {
			mic_stage_samples[frames++] = 0;
		}
		live_tx_offer_stage(mic_stage_samples, MIC_STAGE_FRAMES);
		live_tx_pump(PCM_TX_PUMP_BUDGET_MS);
		if (live_stream_failed) {
			error = -EIO;
		}
	}
	if (journal_open) {
		(void)fs_close(&journal);
	}
	if (error == 0 && pendant_opus_stream_active()) {
		error = pendant_opus_stream_end(NULL);
	}
	if (error == 0) {
		/* Flush whatever the encoder's tail left in the FIFO: a
		 * partial batch would otherwise sit below LIVE_TX_BATCH_BYTES
		 * forever and truncate the question's last word. */
		live_tx_flush = true;
		for (unsigned int pass = 0U;
		     pass < 200U && live_fifo_fill() > 0U && !live_stream_failed;
		     ++pass) {
			live_tx_pump(20U);
		}
		error = pendant_cloud_stream_end();
		printk("LAT ptt_upload_ms=%lld pcm_bytes=%u result=%d\n",
		       k_uptime_get() - ptt_started,
		       pendant_cloud_uploaded_pcm_bytes, error);
	}
	pendant_opus_stream_abort();
	/*
	 * Any failure before stream_end left a chunked POST half-written on an
	 * open TLS socket. Close it here or the next press inherits a stream
	 * the relay is still waiting on — and the modem stays in connected
	 * mode, which is the one thing this whole mode exists to avoid.
	 */
	if (error < 0 && pendant_cloud_stream_active()) {
		pendant_cloud_stream_abort();
	}

	if (error == PENDANT_CLOUD_REPLY_INLINE) {
		int play_error = ptt_reply_play(i2s);

		pendant_cloud_reply_stream_close();
		printk("LAT ptt_total_ms=%lld play=%d\n",
		       k_uptime_get() - ptt_started, play_error);
		/* The answer has been spoken: this is the moment the whole
		 * blue-button cycle was for. */
		pendant_status_set(PENDANT_STATUS_IDLE);
		pendant_status_set(play_error == 0 ? PENDANT_STATUS_DONE
						   : PENDANT_STATUS_FAILED);
		flash_led(2U, 60, 90);
		return play_error;
	}

