agenticaiuw/hivemind/firmware/nrf9160/src/main.c
	if (error < 0) {
		/*
		 * No usable link. The question parks in the outbox under its
		 * own kind: it redelivers with the planner ON (it was a
		 * question, not a memo), but the answer cannot be spoken later
		 * — the socket that would have carried it is gone. It lands in
		 * history instead, and pendant_store.h says so where the kind
		 * is defined.
		 */
		int queue_error = pendant_store_enqueue_question(pcm_bytes);

		pendant_status_set(PENDANT_STATUS_IDLE);
		if (queue_error == 0) {
			printk("PTT question held offline (upload=%d); the "
			       "answer will be in history, not in your ear\n",
			       error);
			pendant_status_set(PENDANT_STATUS_DONE);
			flash_led(2U, 60, 90);
			return 0;
		}
		printk("Could not hold PTT question: %d (upload=%d)\n",
		       queue_error, error);
		pendant_status_set(PENDANT_STATUS_FAILED);
		flash_led(5U, 100, 100);
		return error;
	}

	/* 2xx with no inline reply: the relay took the question but had
	 * nothing to say back. Two calm flashes, same as a memo. */
	printk("PTT question delivered with no spoken reply (HTTP %d)\n",
	       pendant_cloud_last_http_status);
	pendant_status_set(PENDANT_STATUS_IDLE);
	pendant_status_set(PENDANT_STATUS_DONE);
	flash_led(2U, 60, 90);
	return 0;
}

/*
 * Configure every 2026-08-12 breadboard control. All best-effort, all
 * logged: the pattern is the bookmark button's ("losing bookmarks is bad;
 * refusing to boot a voice pendant over a spare button is worse"), applied
 * to five more inputs. A control that fails here simply never fires.
 */
static void configure_control_inputs(void)
{
	/*
	 * What actually came up, for the bench telemetry at the end of this
	 * function. A control that failed above has its key OMITTED from every
	 * telemetry line rather than reported as a level of 0 — see bench.h,
	 * rule 2. These are the only honest source for that: the pad of an
	 * unconfigured pin reads a number, and the number means nothing.
	 */
	struct pendant_bench_config bench = {
		.button_pin = { -1, -1, -1 },
		.encoder_a_pin = -1,
		.encoder_b_pin = -1,
		.mic_sense_pin = -1,
		.amp_pin = -1,
		.firmware = "pendant app",
	};

	/* Yellow "ask": a second body for button 1, same ISR, same
	 * semaphore, so every existing press path hears it unchanged. */
	if (gpio_is_ready_dt(&ask_button) &&
	    gpio_pin_configure_dt(&ask_button, GPIO_INPUT) == 0) {
		ask_button_ready = true;
		bench.button_pin[PENDANT_BENCH_YELLOW] = (int8_t)ask_button.pin;
		bench.button_active_level[PENDANT_BENCH_YELLOW] =
			(ask_button.dt_flags & GPIO_ACTIVE_LOW) ? 0U : 1U;
		gpio_init_callback(&ask_button_callback, button_pressed,
				   BIT(ask_button.pin));
		if (gpio_add_callback(ask_button.port, &ask_button_callback) !=
			    0 ||
		    gpio_pin_interrupt_configure_dt(
			    &ask_button, GPIO_INT_EDGE_TO_ACTIVE) != 0) {
			printk("Ask button (P0.21) unavailable\n");
		}
	} else {
		printk("Ask button (P0.21) not configured\n");
	}

	if (gpio_is_ready_dt(&green_button) &&
	    gpio_pin_configure_dt(&green_button, GPIO_INPUT) == 0) {
		bench.button_pin[PENDANT_BENCH_GREEN] = (int8_t)green_button.pin;
		bench.button_active_level[PENDANT_BENCH_GREEN] =
			(green_button.dt_flags & GPIO_ACTIVE_LOW) ? 0U : 1U;
		gpio_init_callback(&green_button_callback, green_button_pressed,
				   BIT(green_button.pin));
		if (gpio_add_callback(green_button.port,
				      &green_button_callback) != 0 ||
		    gpio_pin_interrupt_configure_dt(
			    &green_button, GPIO_INT_EDGE_TO_ACTIVE) != 0) {
			printk("Memo button (P0.22) unavailable\n");
		}
	} else {
		printk("Memo button (P0.22) not configured\n");
	}

	if (gpio_is_ready_dt(&blue_button) &&
	    gpio_pin_configure_dt(&blue_button, GPIO_INPUT) == 0) {
		bench.button_pin[PENDANT_BENCH_BLUE] = (int8_t)blue_button.pin;
		bench.button_active_level[PENDANT_BENCH_BLUE] =
			(blue_button.dt_flags & GPIO_ACTIVE_LOW) ? 0U : 1U;
		gpio_init_callback(&blue_button_callback, blue_button_pressed,
				   BIT(blue_button.pin));
		if (gpio_add_callback(blue_button.port, &blue_button_callback) !=
			    0 ||
		    gpio_pin_interrupt_configure_dt(
			    &blue_button, GPIO_INT_EDGE_TO_ACTIVE) != 0) {
			printk("Push-to-talk button (P0.23) unavailable\n");
		}
	} else {
		printk("Push-to-talk button (P0.23) not configured\n");
	}

	/* Encoder: both phases in ONE callback (same port), both edges —
	 * the quadrature table needs every transition, not just presses. */
	if (gpio_is_ready_dt(&encoder_a) && gpio_is_ready_dt(&encoder_b) &&
	    gpio_pin_configure_dt(&encoder_a, GPIO_INPUT) == 0 &&
	    gpio_pin_configure_dt(&encoder_b, GPIO_INPUT) == 0) {
		bench.encoder_a_pin = (int8_t)encoder_a.pin;
		bench.encoder_b_pin = (int8_t)encoder_b.pin;
		encoder_prev_state = encoder_read_state();
		gpio_init_callback(&encoder_callback, encoder_edge_isr,
				   BIT(encoder_a.pin) | BIT(encoder_b.pin));
		if (gpio_add_callback(encoder_a.port, &encoder_callback) !=
			    0 ||
		    gpio_pin_interrupt_configure_dt(&encoder_a,
						    GPIO_INT_EDGE_BOTH) != 0 ||
		    gpio_pin_interrupt_configure_dt(&encoder_b,
						    GPIO_INT_EDGE_BOTH) != 0) {
			printk("Encoder (P0.24/25) unavailable\n");
		}
	} else {
		printk("Encoder (P0.24/25) not configured\n");
	}

	/* No encoder-push block, and that is the design: the owner's knob has
	 * no switch wired (P0.28 free). Select is the dwell above. Configuring
	 * an unwired pin as an interrupt source would be a floating input
	 * waking the CPU on breadboard noise. */

	/* Mic-power sense: polled, no interrupt, and NO PULL — it watches
	 * the mic VDD net through 100k and must not bias it. */
	if (gpio_is_ready_dt(&mic_sense) &&
	    gpio_pin_configure_dt(&mic_sense, GPIO_INPUT) == 0) {
		mic_sense_ready = true;
		bench.mic_sense_pin = (int8_t)mic_sense.pin;
		printk("Mic power sense ready (P0.26): mic is %s\n",
		       mic_power_is_cut() ? "MUTED (power cut)" : "powered");
	} else {
		printk("Mic power sense (P0.26) not configured — assuming "
		       "mic powered\n");
	}

	/* Speaker amp gate, driven to the boot default (bluetooth = low =
	 * amp shutdown) before anything can play. Optional like the rest:
	 * no pin, no speaker, everything else unaffected. */
	if (gpio_is_ready_dt(&amp_sd_mode) &&
	    gpio_pin_configure_dt(&amp_sd_mode, GPIO_OUTPUT_INACTIVE) == 0) {
		amp_sd_mode_ready = true;
		bench.amp_pin = (int8_t)amp_sd_mode.pin;
	} else {
		printk("Speaker amp gate (P0.01) not configured\n");
	}
	audio_sink_apply(AUDIO_SINK_BOOT_DEFAULT);

	/* Volume knob (SAADC): probe-once, degrades to "feature absent" on a
	 * bare breadboard. */
	volume_adc_init();

