agenticaiuw/hivemind/firmware/nrf9160/src/main.c
	/*
	 * Last, so it inherits the true outcome of every probe above. The
	 * emitter is read-only from here on — it samples pads and counters and
	 * prints; it never drives a pin, never takes a lock and never touches
	 * a semaphore, so no control's behaviour depends on whether it is
	 * compiled in.
	 */
	pendant_bench_init(&bench);
}

/*
 * The owner hard-muted the mic and pressed a capture button anyway. Say so
 * on every channel this device has: the control frame lets the relay (and
 * eventually the agent) know the press happened and why nothing follows,
 * and the LED pattern answers the thumb directly — three fast double-taps,
 * used nowhere else. Capture is suppressed entirely: recording a powered-
 * down mic would upload thirty seconds of pulldown silence as if the owner
 * had spoken.
 */
static void report_mic_muted_press(void)
{
	/* The long soft buzz is the haptic twin of the triple double-blink:
	 * "heard you, but the red switch says no". */
	haptic_trigger(HAPTIC_PATTERN_LONG);
	printk("Capture press ignored: mic power is cut (red switch)\n");
	if (pendant_ws_connected()) {
		k_mutex_lock(&ws_lock, K_FOREVER);
		(void)pendant_ws_send_text("{\"type\":\"mic_muted\"}");
		k_mutex_unlock(&ws_lock);
	}
	for (unsigned int burst = 0U; burst < 3U; ++burst) {
		flash_led(2U, 40, 40);
		k_msleep(120);
	}
}

int main(void)
{
	const struct device *const i2s = DEVICE_DT_GET(I2S_NODE);
	int error;

	if (!gpio_is_ready_dt(&led)) {
		audio_cycle_result = -ENODEV;
		return 0;
	}
	error = gpio_pin_configure_dt(&led, GPIO_OUTPUT_INACTIVE);
	if (error != 0) {
		audio_cycle_result = error;
		return 0;
	}
	if (!gpio_is_ready_dt(&button)) {
		audio_cycle_result = -ENODEV;
		show_error();
	}
	error = gpio_pin_configure_dt(&button, GPIO_INPUT);
	if (error != 0) {
		audio_cycle_result = error;
		show_error();
	}
	gpio_init_callback(&button_callback, button_pressed, BIT(button.pin));
	error = gpio_add_callback(button.port, &button_callback);
	if (error != 0) {
		audio_cycle_result = error;
		show_error();
	}
	error = gpio_pin_interrupt_configure_dt(&button, GPIO_INT_EDGE_TO_ACTIVE);
	if (error != 0) {
		audio_cycle_result = error;
		show_error();
	}
#ifdef CONFIG_PENDANT_OFFLINE_STORE
	/*
	 * Button 2 is a convenience, not a dependency: if it fails to
	 * configure, log it and keep going. Losing bookmarks is bad; refusing
	 * to boot a voice pendant over a spare button is worse.
	 */
	/*
	 * DT_NODE_HAS_STATUS, not gpio_is_ready_dt, and the difference is a bug
	 * that was live on this board.
	 *
	 * gpio_is_ready_dt() checks the PORT device, never the node's status.
	 * The DK's Button 2 node (sw1) is `status = "disabled"` in the overlay
	 * because its pin was handed to the RGB status LED — but the macro
	 * still resolves to gpio0 pin 7, gpio0 is perfectly ready, and this
	 * branch therefore configured an EDGE_TO_ACTIVE interrupt on the pin
	 * that pendant_status.c drives as the BLUE channel through PWM0.
	 *
	 * The symptom, measured 2026-08-13: the mic reads muted on this board,
	 * muted breathes blue, and every PWM edge on P0.07 fired the bookmark
	 * ISR. The console showed bursts of "Bookmark dropped" and then
	 * "Outbox full — evicting" with 34 phantom marks queued — the device
	 * filling its own durable outbox with events the owner never caused,
	 * and evicting real ones to make room. A disabled node must be gone,
	 * not merely unwired.
	 */
	if (DT_NODE_HAS_STATUS(MARK_BUTTON_NODE, okay) &&
	    gpio_is_ready_dt(&mark_button) &&
	    gpio_pin_configure_dt(&mark_button, GPIO_INPUT) == 0) {
		gpio_init_callback(&mark_button_callback, mark_button_pressed,
				   BIT(mark_button.pin));
		if (gpio_add_callback(mark_button.port,
				      &mark_button_callback) != 0 ||
		    gpio_pin_interrupt_configure_dt(
			    &mark_button, GPIO_INT_EDGE_TO_ACTIVE) != 0) {
			printk("Bookmark button unavailable — use "
			       "pendant_remote_mark\n");
		}
	} else {
		printk("Bookmark button not present on this board\n");
	}
#endif
	configure_control_inputs();

	/*
	 * FEEDBACK BEFORE FALLIBILITY.  Everything from here down can fail
	 * fatally — the I2S device, the microSD mount, the modem — and every
	 * one of those failures ends in show_error(), which never returns.
	 * So the two channels that tell the owner what happened have to be
	 * alive BEFORE the first of them, or a boot that dies on a missing
	 * card leaves the status LED unconfigured and the pendant simply dark:
	 * the exact symptom that reads as "the LED is broken".
	 *
	 * Both are safe this early.  haptic_init() is a single I2C probe and
	 * degrades to "no motor" on a bare breadboard.  pendant_status_init()
	 * configures three pads and schedules one work item; the mic-mute
	 * probe it is handed is guarded by mic_sense_ready, so calling it
	 * before the sense pin exists reports "not muted" rather than reading
	 * an unconfigured pad.  configure_control_inputs() above has in fact
	 * already set that pin up — this ordering is belt and braces.
	 */
	(void)haptic_init();
	/*
	 * The one and only I2C probe this firmware performs, so it is the only
	 * honest source for the bench's bus tile. Reported as an ADDRESS LIST
	 * (empty when the part stayed silent), never as "the bus is broken":
	 * the external 4.7k pull-ups and their 3 V rail were measured healthy
	 * over SWD on 2026-08-13, so silence here is a question about the
	 * DRV2605L's own power or its SDA/SCL leg.
	 */
	pendant_bench_note_i2c(haptic_available());
	pendant_status_init(mic_power_is_cut);

	if (!device_is_ready(i2s)) {
		audio_cycle_result = -ENODEV;
		show_error();
	}

	if (mount_sd_card() == 0 && test_sd_persistence() != 0) {
		sd_ready = false;
	}
	/*
	 * Re-stated AFTER the persistence test, not just inside mount_sd_card:
	 * a card that mounts and then cannot be written to is the failure this
	 * board actually has, and reporting the mount alone told the dashboard
	 * "sd mounted: true" about a card the firmware had already given up on.
	 * The bench must agree with the firmware's own verdict or it is not an
	 * instrument, it is a second opinion nobody asked for.
	 */
	pendant_bench_note_sd(sd_ready);
	if (!sd_ready) {
		/*
		 * A BAD CARD COSTS THE CARD'S FEATURES AND NOTHING ELSE.
		 *
		 * This used to be show_error(), which never returns. One
		 * optional peripheral therefore took down LTE, the WebSocket,
		 * Bluetooth, every button, the status vocabulary and the menu
		 * grammar — a fault-coupling bug in the most literal sense.
		 * Measured 2026-08-13: the pendant had been halting here on
		 * every boot, and because the device has no screen the symptom
		 * was indistinguishable from a flat battery or an unflashed
		 * chip. Nobody noticed for a day.
		 *
		 * What is actually lost without the card is narrow and worth
		 * naming precisely: the offline outbox, the alert inbox, and
		 * the journal that record_microphone() falls back to when
		 * there is NO live uplink at press time. With a live uplink —
		 * the normal case — recording and conversation do not touch
		 * the card at all (see the live_encoder_ok branch in
		 * record_microphone: the SD write is deliberately kept out of
		 * the hot loop). So the pendant still listens, still talks,
		 * still answers; it just cannot remember through a dead zone.
		 *
		 * It must SAY that, because a screenless device that degrades
		 * silently is a device that lies by omission. Three channels,
		 * in the order they can reach the owner:
		 */
		storage_degraded = true;
		atomic_set(&storage_notice_req, 1);
		/*
		 * Both codes, because they answer different questions and the
		 * first draft of this line printed only the mount result — "(0)",
		 * i.e. "unavailable, and the mount was fine", which tells the
		 * reader nothing about which half failed. mount=0 write=-2 says
		 * exactly what happened: the card is present and the volume
		 * mounted; it was the write test that did not pass.
		 */
		printk("microSD unavailable (mount=%d write=%d) — voice upload "
		       "journal, offline outbox and alert inbox are OFF for "
		       "this boot; conversation, buttons, LTE and Bluetooth "
		       "are unaffected\n",
		       sd_mount_result, sd_test_write_result);
		audio_cycle_result = sd_mount_result != 0 ? sd_mount_result
							 : sd_test_write_result;
		/*
		 * 1. Immediately, locally, with no network: the OS's existing
		 *    "that did not work" signature — three red blinks and a
		 *    two-part buzz. It is the same vocabulary the owner
		 *    already knows from a failed action, which is the point:
		 *    a new signal nobody has been taught is not a signal.
		 */
		pendant_status_set(PENDANT_STATUS_FAILED);
		/*
		 * 2. Spoken, at the first opportunity the device HAS to
		 *    speak. This firmware plays audio only inside a started
		 *    conversation, so there is no honest way to say a sentence
		 *    at boot; the notice is queued and rides the converse
		 *    socket instead (see storage_degraded's declaration).
		 * 3. And on the bench console/dashboard, already sent above.
		 */
	}

