agenticaiuw/hivemind/firmware/nrf9160/src/main.c
				if (length > 0U && pendant_ws_connected()) {
					k_mutex_lock(&ws_lock, K_FOREVER);
					(void)pendant_ws_send_text(devices);
					k_mutex_unlock(&ws_lock);
				}
				pendant_bt_list_answered();
			}
			/* Knob while idle: 5 Hz (this loop's cadence) is
			 * plenty for a level that only matters once audio
			 * plays; the conversation loop polls at full rate. */
			volume_poll();
			/*
			 * The bench, on the loop the owner is actually looking
			 * at: this is where the pendant sits while a wire is
			 * being wiggled. A press shorter than this loop's 200 ms
			 * turn is still caught — the ISR latches the edge and
			 * this call drains it (see bench.h).
			 */
			pendant_bench_tick();
			/*
			 * An injected relay frame, if a debugger left one.
			 * Runs on main so it can reach the reflex layer's card
			 * writes exactly like a real downlink frame does.
			 */
			if (pendant_remote_frame_ready != 0U) {
				char frame[sizeof(pendant_remote_frame)];

				pendant_remote_frame_ready = 0U;
				memcpy(frame, (const void *)pendant_remote_frame,
				       sizeof(frame));
				frame[sizeof(frame) - 1U] = '\0';
				printk("Injected frame: %s\n", frame);
				if (!menu_context_offer_frame(frame) &&
				    !audio_sink_offer_frame(frame) &&
				    !pendant_reflex_offer_frame(frame)) {
					(void)pendant_bt_offer_frame(frame);
				}
			}
			/*
			 * Button 2 needs no radio, no microphone and no
			 * decision about whether the link is usable. It is
			 * the one thing this device can always do.
			 *
			 * A double-press inside 600 ms is the reflex
			 * gesture; the window only opens while a gesture
			 * recipe is armed (see reflex_mark_double_press),
			 * so the plain bookmark path is undelayed until
			 * the owner installs one.
			 */
			if (take_mark_press()) {
				if (reflex_mark_double_press()) {
					pendant_reflex_fire_gesture();
					continue;
				}
				marked = true;
				break;
			}
			/*
			 * Reflex work rides the idle wait, the one context
			 * where I2S, the codec scratch and the SD card are
			 * all guaranteed unowned: store a pending downlink
			 * recipe (+ack upstream), then fire whatever came
			 * due.  Recipes received mid-conversation sit in
			 * their one-slot buffer until the conversation
			 * ends and this loop runs again.
			 */
			{
				char reflex_ack[96];

				if (pendant_reflex_process_pending(
					    reflex_ack,
					    sizeof(reflex_ack)) > 0 &&
				    pendant_ws_connected()) {
					k_mutex_lock(&ws_lock, K_FOREVER);
					(void)pendant_ws_send_text(
						reflex_ack);
					k_mutex_unlock(&ws_lock);
				}
			}
			pendant_reflex_tick();
			apply_forced_link_state();
			if (!pendant_ws_connected() &&
			    !link_is_forced_offline()) {
				int ws_error;

				k_mutex_lock(&ws_lock, K_FOREVER);
				ws_error = pendant_ws_connect();
				k_mutex_unlock(&ws_lock);
				if (ws_error != 0) {
					printk("Idle WS reconnect failed: %d\n",
					       ws_error);
				}
			}

			/*
			 * Drain the backlog HERE, inside the wait, not at the
			 * top of the outer loop: the outer loop only turns
			 * over when a press ends, so a device sitting idle
			 * after a dead zone would hold yesterday's memos
			 * until the owner happened to press the button —
			 * exactly the person the queue exists to spare.
			 *
			 * A live WebSocket is the only honest proof this
			 * device has that the link works (the modem reports
			 * an attached network while every relay socket times
			 * out), so delivery is gated on that and never on a
			 * timer or on optimism. One item per pass, skipped
			 * entirely while a press is pending: a held 30 s memo
			 * takes seconds to upload and the owner must never
			 * wait behind it.
			 */
			if (pendant_ws_connected()) {
				pendant_store_poll_alerts();
				if (pendant_store_pending() > 0U &&
				    k_sem_count_get(&button_press_sem) == 0U &&
				    pendant_remote_press == 0U) {
					(void)pendant_store_drain_one(
						SAMPLE_RATE);
				}
			}
		}
		/* Latency-first: act on the active edge, never the release. */
		clear_button_events();

		/*
		 * BENCH PROBE MODE — press the buttons without speaking to the
		 * cloud.
		 *
		 * Testing a button used to cost the owner a real cloud
		 * conversation, and on this board every one of them captured
		 * silence (the mic reads unpowered) and landed in his feed as
		 * "Untitled run — Didn't catch that", plus the spend. A test
		 * that costs the owner junk in his own history is a test
		 * nobody runs enough.
		 *
		 * Armed over SWD like every other debug hook here, so it needs
		 * no reflash and cannot be left on by a build:
		 *
		 *   w4 <&pendant_bench_probe> 1    arm
		 *   w4 <&pendant_bench_probe> 0    disarm
		 *
		 * While armed, a press is fully OBSERVED and fully INERT: the
		 * ISR has already latched the edge and the BENCH line reports
		 * the raw level either way, so the wire question is answered
		 * exactly as well as before — only the conversation, the memo,
		 * the push-to-talk and the bookmark are withheld. It is
		 * deliberately placed after clear_button_events() so a probe
		 * press cannot be banked and replayed the moment it disarms.
		 */
		/*
		 * ---- ONE PLACE DECIDES WHAT THE PRESS MEANT ----
		 *
		 * Resolved before anything acts on it, so the decision can be
		 * logged, withheld by the probe, or executed — all from the
		 * same answer. Two verbs cannot disagree about one press.
		 *
		 * Context first. With a ring open the buttons belong to the
		 * ring, and that outranks even the mic-power gate below:
		 * choosing a menu entry needs no microphone, and a device that
		 * refused to navigate its own menus because the owner had muted
		 * the mic would be applying a capture rule to a menu.
		 *
		 * If the relay never told us, or the frame was lost, or the
		 * socket dropped, menu_context_is_active() is false and every
		 * press runs its GLOBAL verb. That default is the whole safety
		 * property — see menu_context_active's declaration.
		 */
		const bool ring_open = menu_context_is_active() && !marked;
		bool ptt_requested = false;

		if (!ring_open && !blue_pressed && !marked) {
			ptt_requested = yellow_held_long();
		}

		const char *verb =
			marked            ? "bookmark"
			: ring_open       ? (blue_pressed ? "menu_back"
							  : "menu_select")
			: blue_pressed    ? "memo"
			: ptt_requested   ? "push-to-talk question"
					  : "conversation";

		printk("%s press -> %s\n",
		       marked ? "Mark" : blue_pressed ? "Blue (P0.23)"
						      : "Yellow (P0.21)",
		       verb);

