agenticaiuw/hivemind/firmware/nrf9160/src/main.c
		if (pendant_bench_probe != 0U) {
			clear_green_events();
			clear_blue_events();
			printk("Bench probe: withheld '%s' — press observed, "
			       "nothing run\n",
			       verb);
			continue;
		}

		if (ring_open) {
			atomic_set(blue_pressed ? &menu_back_req
						: &menu_select_req,
				   1);
			/* The tick is the owner's only acknowledgement that
			 * the ring took the press: the spoken result comes
			 * from the relay a beat later, and on a screenless
			 * device a gesture with no immediate answer reads as
			 * a dead button. */
			haptic_trigger(HAPTIC_PATTERN_TICK);
			clear_green_events();
			clear_blue_events();
			continue;
		}

		if (marked) {
			(void)pendant_store_enqueue_mark(
				pendant_ws_connected());
			/* One short flash: marked, nothing else happened. */
			flash_led(1U, 60, 120);
			continue;
		}

		/*
		 * Every capture path defers to the red latching switch: with
		 * mic power cut there is nothing to record, only a pulldown
		 * hum to upload, so the press becomes a notification instead
		 * of a capture. Checked before the WS/legacy split because
		 * it outranks both.
		 */
		if (mic_power_is_cut()) {
			report_mic_muted_press();
			clear_green_events();
			clear_blue_events();
			clear_button_events();
			continue;
		}

		/* Blue, ring closed: the memo. Record-only, no planner. */
		if (blue_pressed) {
			audio_cycle_phase = 1U;
			/* Memo opens on a tick (and closes on one — see the
			 * stop path in record_microphone). */
			haptic_trigger(HAPTIC_PATTERN_TICK);
			(void)run_memo_capture(i2s);
			clear_blue_events();
			clear_button_events();
			continue;
		}

		if (ptt_requested) {
			audio_cycle_phase = 1U;
			/* Same click a command press gets: the thumb is told
			 * the microphone is live before any other work. */
			haptic_trigger(HAPTIC_PATTERN_CLICK);
			(void)run_ptt_question(i2s);
			clear_blue_events();
			clear_button_events();
			continue;
		}

		/*
		 * The owner is here. This is the moment the alert inbox
		 * exists for, and it deliberately runs BEFORE any decision
		 * about the link: reading held alerts is a card read and a
		 * printk, so it works identically with the radio powered off.
		 */
		if (pendant_store_inbox_pending() > 0U) {
			flash_led(2U, 60, 90);
			pendant_store_surface_inbox();
		}

		/*
		 * Press = converse. Full-duplex WebSocket when the socket is
		 * up; the proven record-then-reply HTTP cycle when it is not
		 * (that path still journals to microSD when LTE is down).
		 */
		audio_cycle_phase = 1U;
		/* Press acknowledged in the skin, before any radio work —
		 * the LED's answer can be seconds away on a cold socket. */
		haptic_trigger(HAPTIC_PATTERN_CLICK);
		int64_t lat_press_started = k_uptime_get();

		bool ws_ready = pendant_ws_connected();

		if (!ws_ready && !link_is_forced_offline()) {
			k_mutex_lock(&ws_lock, K_FOREVER);
			ws_ready = pendant_ws_connect() == 0;
			k_mutex_unlock(&ws_lock);
		}
		if (ws_ready) {
			error = run_conversation(i2s);
			/* Idle first, THEN the verdict: idle is what the
			 * device goes back to, and it also clears any
			 * approval the owner just answered out loud. */
			pendant_status_set(PENDANT_STATUS_IDLE);
			gpio_pin_set_dt(&led, 0);
			printk("LAT conversation_ms=%lld result=%d\n",
			       k_uptime_get() - lat_press_started, error);
			report_main_stack_headroom("conversation");
			if (error != 0) {
				audio_cycle_result = error;
				pendant_status_set(PENDANT_STATUS_FAILED);
				flash_led(4U, 100, 100);
			} else {
				audio_cycle_result = 0;
				pendant_status_set(PENDANT_STATUS_DONE);
			}
			clear_button_events();
			continue;
		}

		error = record_microphone(
			i2s,
#if PENDANT_BOOT_AUDIO_CYCLE_TEST
			AUTORECORD_TEST_SAMPLE_COUNT
#else
			MAX_RECORD_SAMPLE_COUNT
#endif
		);
		int capture_error = error;

		/* Mic closed; the upload is the work that follows. */
		pendant_status_set(PENDANT_STATUS_THINKING);
		gpio_pin_set_dt(&led, 0);
		audio_cycle_phase = 2U;
		if (capture_error != 0) {
			printk("Microphone recording failed: %d\n", capture_error);
			pendant_cloud_stream_abort();
			recording_on_sd = false;
			audio_cycle_result = capture_error;
			pendant_status_set(PENDANT_STATUS_IDLE);
			pendant_status_set(PENDANT_STATUS_FAILED);
			flash_led(3U, 120, 120);
			clear_button_events();
			continue;
		}

		/*
		 * Prefer live chunked POST; fall back to microSD single-shot
		 * when prewarm failed, live TX aborted, or stream_end fails.
		 */
		audio_cycle_phase = 3U;
		{
			uint32_t pcm_bytes =
				recorded_samples * (uint32_t)sizeof(int16_t);
			bool live_ok = pendant_cloud_stream_active() &&
				       !live_stream_failed &&
				       pendant_cloud_stream_bytes_sent() > 0U;

			error = -EIO;
			if (live_ok) {
				error = pendant_cloud_stream_end();
				printk("LAT live_stream_end_ms=%lld pcm_bytes=%u "
				       "result=%d\n",
				       k_uptime_get() - lat_press_started,
				       pendant_cloud_uploaded_pcm_bytes, error);
			} else if (pendant_cloud_stream_active()) {
				pendant_cloud_stream_abort();
			}

			if (error < 0 && recording_on_sd && pcm_bytes > 0U) {
				printk("Fallback SD PCM upload (%u bytes) "
				       "(live_result=%d live_sent=%u)\n",
				       pcm_bytes, error,
				       pendant_cloud_stream_bytes_sent());
				error = pendant_cloud_upload_recording(
					SD_RECORDING_PATH, pcm_bytes,
					SAMPLE_RATE);
				printk("LAT fallback_upload_ms=%lld "
				       "pcm_bytes=%u result=%d\n",
				       k_uptime_get() - lat_press_started,
				       pendant_cloud_uploaded_pcm_bytes, error);
				if (error < 0) {
					/*
					 * Both uplinks are gone and the mic
					 * journal on the card is all that is
					 * left of what the owner said. Take
					 * ownership of it (a rename, not a
					 * copy) before the next press
					 * truncates the file. This is the
					 * ONLY place a recording is retained
					 * past its upload attempt — the
					 * standing rule is that SD is the
					 * failure path, never the default.
					 */
					int queue_error =
						pendant_store_enqueue_voice(
							pcm_bytes);

					if (queue_error == 0) {
						printk("Voice memo held for "
						       "later delivery "
						       "(upload=%d)\n",
						       error);
						audio_cycle_result = 0;
						pendant_status_set(
							PENDANT_STATUS_IDLE);
						pendant_status_set(
							PENDANT_STATUS_DONE);
						flash_led(2U, 60, 90);
						clear_button_events();
						continue;
					}
					printk("Could not hold voice memo: "
					       "%d\n",
					       queue_error);
				}
			} else if (error < 0) {
				printk("Live stream dead and no SD backup "
				       "(pcm_bytes=%u recording_on_sd=%d)\n",
				       pcm_bytes, recording_on_sd ? 1 : 0);
				error = -EIO;
			}
		}
		report_main_stack_headroom("upload");
		printk("LAT press_to_upload_done_ms=%lld\n",
		       k_uptime_get() - lat_press_started);
		if (error == PENDANT_CLOUD_REPLY_INLINE) {
			/*
			 * Legacy fallback cannot voice replies anymore: the
			 * ESP32 bridge now speaks the duplex wire format
			 * (32-bit slots @31250) and the old 16-bit/24 kHz
			 * player would be noise. The command still executed
			 * and both transcripts + audio are in the dashboard;
			 * voice replies need the WebSocket link.
			 */
			audio_cycle_phase = 6U;
			pendant_cloud_reply_stream_close();
			printk("Reply ready server-side; voice playback "
			       "requires the duplex link (WS was down)\n");
			clear_button_events();
			goto reply_done;
		}
		if (error != 0) {
			printk("Internet voice cycle failed: %d "
			       "(transcribe=%d dispatch=%d HTTP=%d)\n",
			       error, pendant_cloud_transcribe_result,
			       pendant_cloud_dispatch_result,
			       pendant_cloud_last_http_status);
			audio_cycle_result = error;
			pendant_status_set(PENDANT_STATUS_IDLE);
			pendant_status_set(PENDANT_STATUS_FAILED);
			flash_led(5U, 100, 100);
			continue;
		}

		/* Same story as the inline branch: the fallback delivered the
		 * command; the spoken reply lives in the dashboard until the
		 * duplex link is back. */
		audio_cycle_phase = 4U;
		printk("Command delivered via fallback; voice reply "
		       "requires the duplex link (WS was down)\n");

reply_done:
		audio_cycle_phase = 7U;
		audio_cycle_result = 0;
		pendant_status_set(PENDANT_STATUS_IDLE);
		pendant_status_set(PENDANT_STATUS_DONE);
		for (unsigned int flash = 0U; flash < 3U; ++flash) {
			gpio_pin_set_dt(&led, 1);
			k_msleep(180);
			gpio_pin_set_dt(&led, 0);
			k_msleep(180);
		}
		k_msleep(200);
	}
}
